Repository: KDE/kate
Catalog: po/*/formatplugin.po
Languages: bg, ca, eo, eu, gl, nl, pt_br, ta, tr

source: Format
bg: Форматиране
eo: Formato
eu: Formatua
gl: Formatar
nl: Opmaak
pt_br: Formato
ta: வடிவமை
tr: Biçimlendir

source: Failed to write a temp file
bg: Неуспешно записване на временен файл
ca: Ha fallat en escriure un fitxer temporal
eo: Malsukcesis skribi provizoran dosieron
eu: Aldi baterako fitxategi bat idaztea huts egin du
gl: Non foi posíbel escribir un ficheiro temporal.
nl: Naar tijdelijk bestand schrijven is mislukt
pt_br: Falha ao gravar um arquivo temporário
ta: தற்காலிக் கோப்புக்கு எழுத முடியவில்லை
tr: Bir geçici dosya yazılamadı

source: Failed to run git diff: git not installed
bg: Неуспешно изпълнение на git diff: git не е инсталиран
ca: Ha fallat en executar el «diff» del «git»: el «git» no està instal·lat
eu: "git diff" exekutatzea huts egin du: git ez dago instalatuta
pt_br: Falha ao executar git diff: git não está instalado
tr: git diff çalıştırılamadı: Git kurulu değil

source: Failed to run git diff: %1
bg: Неуспешно изпълнение на git diff: %1
ca: Ha fallat en executar el «diff» del «git»: %1
eo: Malsukcesis efektivigi git diff: %1
eu: "git diff" exekutatzea huts egin du: %1
gl: Non foi posíbel executar «git diff»: %1
nl: Uitvoeren van git diff is mislukt: %1
pt_br: Falha ao executar git diff: %1
ta: git diff தனை இயக்க முடியவில்லை: %1
tr: git diff çalıştırılamadı: %1

source: User Settings
bg: Потребителски настройки
ca: Configuració de l'usuari
eo: Uzant-Agordoj
eu: Erabiltzaile-ezarpenak
gl: Configuración persoal
nl: Gebruikersinstellingen
pt_br: Configurações do usuário
ta: பயனர் அமைத்த அமைப்புகள்
tr: Kullanıcı Ayarları

source: Default Settings
bg: Настройки по подразбиране
ca: Configuració predeterminada
eo: Defaŭltaj Agordoj
eu: Ezarpen lehenetsiak
gl: Configuración predeterminada
nl: Standaardinstellingen
pt_br: Configurações padrão
ta: இயல்பிருப்பு அமைப்புகள்
tr: Öntanımlı Ayarlar

source: Formatting
bg: Форматиране
ca: Donar format
eo: Formatado
eu: Formatua ematea
gl: Formatación
nl: Formatteren
pt_br: Formatação
ta: வடிவமைப்பு
tr: Biçimlendirme

source: Formatting Settings
bg: Настройки за форматиране
ca: Configuració de donar format
eo: Formatad-Agordoj
eu: Formatua emateko ezarpenak
gl: Configuración de formatación
nl: Instellingen voor het formaat
pt_br: Configurações de formatação
ta: வடிவமைப்பு அமைப்புகள்
tr: Biçimlendirme Ayarları

source: Failed to read settings.json. Error: %1
bg: Неуспешно четене на settings.json. Грешка: %1
ca: Ha fallat en llegir «settings.json». Error: %1
eo: Malsukcesis legi settings.json. Eraro: %1
eu: settings.json irakurtzea huts egin du. Errorea: %1
gl: Non foi posíbel ler «settings.json». Erro: %1
nl: Lezen van settings.json is mislukt. Fout: %1
pt_br: Falha ao ler settings.json. Erro: %1
ta: settings.json தனைப் படிக்க முடியவில்லை. சிக்கல்: %1
tr: settings.json okunamadı. Hata: %1

source: Format Document
bg: Форматиране на документ
ca: Dona format a un document
eo: Formati Dokumenton
eu: Dokumentu bati formatua ematea
gl: Formatar o documento
nl: Formaatdocument
pt_br: Formatação do documento
ta: ஆவணத்தை வடிவமை
tr: Belgeyi Biçimlendir

source: Format on Save
bg: Форматиране при запазване
ca: Format en desar
eo: Formati je Konservado
eu: Eman formatua gordetzean
gl: Formatar ao gardar
nl: Formaat bij opslaan
pt_br: Formatação ao salvar
ta: சேமிக்கும்போது வடிவமை
tr: Kaydederken Biçimlendir

source: Disable formatting on save without persisting it in settings
bg: Деактивиране на форматирането при запазване, без да го запазвате в настройките
ca: Desactiva donar format en desar sense persistir a la configuració
eo: Malebligi formatadon je konservado sen persistigi ĝin en agordoj
eu: Ezgaitu gordetzean formatua ematea, ezarpenetan aldaketarik egin gabe
gl: Desactivar a formatación ao gardar sen aplicalo á configuración.
nl: Formattering uitschakelen bij opslaan zonder er in te volharden in instellingen
pt_br: Desabilitar a formatação ao salvar sem persistir nas configurações
ta: இந்த ஒருமுறை மட்டும் சேமிக்கும்போது வடிவமைக்காதே (இந்த அமைப்பை சேமிக்காமல்)
tr: Ayarı kalıcı yapmadan kaydederken biçimlendirmeyi devre dışı bırak

source: %1: Unexpected empty command!
bg: %1: Неочаквана празна команда!
ca: %1: Ordre buida inesperada!
eo: %1: Neatendita malplena komando!
eu: %1: Ustekabeko komando hutsa!
gl: %1: a orde está inesperadamente baleira!
nl: %1: onverwacht leeg commando!
pt_br: %1: Comando vazio inesperado!
ta: %1: எதிர்பார்க்கப்படாத காலியான கட்டளை!
tr: %1: Beklenmedik boş komut!

source: %1 is not installed, please install it to be able to format this document!
bg: %1 не е инсталиран, моля, инсталирайте го, за да можете да форматирате този документ!
ca: %1 no està instal·lat. Instal·leu-lo per a poder donar format a aquest document!
eo: %1 ne estas instalita, bonvolu instali ĝin por povi formati ĉi dokumenton!
eu: %1 ez dago instalatuta, mesedez, hura instalatu dokumentu horri formatua eman ahal izateko!
gl: %1 non se instalou, debe instalarse para formatar o documento!
nl: %1 is niet ge√Ønstalleerd, installeer het om in staat te zijn dit document te formatteren!
pt_br: %1 não está instalado. Instale-o para poder formatar este documento!
ta: %1 நிறுவப்படவில்லை, இந்த ஆவணத்தை வடிவமைக்க அதை நிறுவ‍வும்!
tr: %1 kurulu değil, bu belgeyi biçimlendirebilmek için önce onu kurun!

source: Please install node and prettier
bg: Моля, инсталирайте node и prettier
ca: Instal·leu el «note» i el «prettier»
eo: Bonvolu instali node kaj prettier
eu: Mesedez, instalatu node eta prettier
gl: Instale «node» e «prettier».
nl: Installeer node en mooier
pt_br: Por favor, instale o node e o prettyer
ta: node-ஐயும் prettier-ஐயும் நிறுவ‍வும்
tr: Lütfen node ve prettier kurun

source: PrettierFormat: Failed to create temporary file
bg: PrettierFormat: Неуспешно създаване на временен файл
ca: PrettierFormat: Ha fallat en crear el fitxer temporal
eo: PrettierFormat: Malsukcesis krei provizoran dosieron
eu: PrettierFormat: Aldi baterako fitxategia sortzea huts egin du
gl: PrettierFormat: non foi posíbel crear un ficheiro temporal.
nl: MooierFormaat: aanmaken van tijdelijk bestand is mislukt
pt_br: FormatoPrettier: Falha ao criar arquivo temporário
ta: PrettierFormat: தற்காலிக‍க் கோப்பை உருவாக்க முடியவில்லை
tr: PrettierFormat: Geçici dosya oluşturulamadı

source: PrettierFormat: Failed to start 'node': %1
bg: PrettierFormat: Неуспешно стартиране на 'node': %1
ca: PrettierFormat: Ha fallat en iniciar el «node»: %1
eo: PrettierFormat: Malsukcesis startigi 'node': %1
eu: PrettierFormat: 'node' irekitzea huts egin du: %1
gl: PrettierFormat: non foi posíbel iniciar «node»: %1
nl: MooierFormaat: 'note' starten is mislukt: %1
pt_br: FormatoPrettier: Falha ao iniciar 'nó': %1
tr: PrettierFormat: “node” başlatılamadı: %1

source: Unknown formatterForJson: %1
bg: Неизвестен formatterForJson: %1
ca: «formatterForJson» desconegut: %1
eo: Nekonata formatterForJson: %1
eu: formatterForJson ezezaguna: %1
gl: formatterForJson (formatador para JSON) descoñecido: %1
nl: Onbekende formatterForJson: %1
pt_br: formatterForJson desconhecido: %1
ta: தெரியாத formatterForJson: %1
tr: Bilinmeyen JSON biçimlendiricisi: %1

source: Unknown formatterForPython: %1
bg: Неизвестен formatterForPython: %1
ca: «formatterForPython» desconegut: %1
eo: Nekonata formatterForPython: %1
eu: formatterForPython ezezaguna: %1
gl: formatterForPython (formatador para Python) descoñecido: %1
nl: Onbekende formatterForPython: %1
pt_br: formatterForPython desconhecido: %1
ta: தெரியாத formatterForPython: %1
tr: Bilinmeyen Python biçimlendiricisi: %1

source: Unknown formatterForYaml: %1, falling back to yamlfmt
bg: Неизвестен formatterForYaml: %1, връщане към yamlfmt
ca: «formatterForYaml» desconegut: %1, es torna de nou al «yamlfmt»
eo: Nekonata formatterForYaml: %1, retrofalante al yamlfmt
eu: formatterForYaml ezezaguna: %1, yamlfmt-era atzera egiten
gl: formatterForYaml (formatador de YAML) «%1» descoñecido, usarase yamlfmt.
nl: Onbekende formatterForYaml: %1, valt terug op yamlfmt
pt_br: formatterForYaml desconhecido: %1, voltando para yamlfmt
tr: Bilinmeyen YAML biçimlendiricisi: %1, yamlfmt’ye geri dönülüyor

source: Failed to run formatter. Unsupported language %1
bg: Неуспешно стартиране на инструмента за форматиране. Неподдържан език %1
ca: Ha fallat en executar el formatador. Llenguatge %1 no implementat
eo: Malsukcesis efektivigi formatilon. Nesubtenata lingvo %1
eu: Formatu emailea exekutatzea huts egin du. Euskarririk gabeko lengoaia, %1
gl: Non foi posíbel executar o formatador. Non é compatíbel coa linguaxe «%1».
nl: Uitvoeren van formatter is mislukt. Niet ondersteunde taal %1
pt_br: Falha ao executar formatador. Linguagem %1 não suportada
ta: வடிவமைப்பியை இயக்க முடியவில்லை. ஆதரிக்கப்படாத மொழி: %1
tr: Biçimlendirici çalıştırılamadı. Desteklenmeyen dil %1
