Repository: KDE/kate
Catalog: po/*/katecloseexceptplugin.po
Languages: pt

# NAME OF TRANSLATORS
source: Your names
pt: César A. P. Cláudio, José Nuno Pires

# EMAIL OF TRANSLATORS
source: Your emails
pt: cesarapclaudio@gmail.com, zepires@gmail.com

# @title:window
source: Close files confirmation
pt: Confirmação de fecho de ficheiros

# @label:listbox
source: You are about to close the following documents:
pt: Está prestes a fechar os seguintes documentos:

# @title:column
source: Document
pt: Documento

# @title:column
source: Location
pt: Localização

# option:check
source: Do not ask again
pt: Não perguntar novamente

# @action:inmenu
source: Show Confirmation
pt: Mostrar confirmação

# @action:inmenu close docs except the following...
source: Close Except
pt: Fechar exceto

# @action:inmenu close docs like the following...
source: Close Like
pt: Fechar semelhantes

source: Close Except/Like Plugin
pt: Suplemento "Fechar exceto/semelhantes"

# @title:window
source: Error
pt: Erro

# @info:tooltip
source: No files to close ...
pt: Nenhum ficheiro para fechar...

# @title:window
source: Done
pt: Concluído

source: %1 file closed
pt: %1 ficheiro fechado
