Repository: KDE/kate
Catalog: po/*/kateexternaltoolsplugin.po
Languages: ar, gl

# External tool name
source: Clang Format Full File
ar: تنسيق clang ملف كامل
gl: ClangFormat para ficheiro completo

# External tool category
source: Tools
ar: أدوات
gl: Ferramentas

# External tool name
source: Clang Format Selected Text
ar: تنسيق clang النص المحدد
gl: ClangFormat para texto seleccionado

# External tool name
source: Compile and Run cpp
ar: تصريف وتشغيل cpp
gl: Compilar e executar C++

# External tool name
source: git blame
ar: غت بلام

# External tool category
source: Git
ar: غت

# External tool name
source: git-cola
ar: جيت-كولا

# External tool name
source: gitk
ar: جيتك

# External tool name
source: Go Fmt Full File
ar: تنسيق ملف كامل لغو
gl: Go Fmt para ficheiro completo

# External tool category
source: Go
ar: غو

# External tool name
source: GoImports Full File
ar: GoImports ملف كامل
gl: GoImports para ficheiro completo

# External tool name
source: Google Selected Text
ar: غوغل النص المحدد
gl: Busca en Google de texto seleccionado

# External tool name
source: Insert UUID
ar: أدخل UUID
gl: Inserir un UUID

# External tool name
source: JSON Format Full File
ar: تنسيق JSON ملف كامل
gl: JSON Format para ficheiro completo

# External tool name
source: Prettier Format Current File
ar: تنسيق أجمل للملف الحالي
gl: Prettier Format para o ficheiro actual

# External tool name
source: Qt Quick 2 Preview (qmlscene)
ar: معاينة Qt Quick 2 (qmlscene)
gl: Vista previa de Qt Quick 2 (qmlscene)

# External tool category
source: Qt
ar: كيوت

# External tool name
source: Run Shell Script
ar: تشغيل البرنامج النصي شل
gl: Executar un guión de intérprete de ordes

# External tool name
source: Rust Fmt Full File
ar: تنسيق رست لملف كامل
gl: Rust Fmt para ficheiro completo

# External tool name
source: Search KDE API
ar: بحث كيدي API
gl: Buscar na API de KDE

# External tool name
source: Search Qt API
ar: بحث QT API
gl: Buscar na API de Qt

# External tool name
source: XML Format Full File
ar: تنسيق XML ملف كامل
gl: XML Format para ficheiro completo

source: This list shows all the configured tools, represented by their menu text.
ar: تعرض هذه القائمة جميع الأدوات التي المضبوطة ، ممثلة بنص القائمة الخاص بهم.
gl: A lista amosa as ferramentas configuradas, representadas polo texto da súa entrada de menú.

source: &Add
ar: أ&ضف
gl: Eng&adir

source: &Edit...
ar: &حرّر...
gl: &Editar…

source: &Remove
ar: أ&زل
gl: &Retirar

source: Failed to find executable '%1'. Please make sure the executable file exists and that variable names, if used, are correct
ar: فشل العثور على الملف القابل للتنفيذ '%1'. يرجى التأكد من وجود الملف القابل للتنفيذ ومن صحة أسماء المتغيرات، إذا تم استخدامها
gl: Non foi posíbel atopar o executábel «%1». Asegúrese de que o ficheiro executábel existe e, se usa nomes de variábeis, de que están ben escritos.

source: External Tools
ar: الأدوات الخارجية
gl: Ferramentas externas

source: Running %1: %2 %3
ar: تشغيل %1: %2 %3
gl: Executando %1: %2 %3

source: Running %1: %2 %3 with input %4
ar: تشغيل %1: %2 %3 مع الإدخال %4
gl: Executando %1: %2 %3 coa entrada %4

source: Data written to stderr:
ar: البيانات المكتوبة إلى Stderr:
gl: Datos escritos en stderr:

source: %1 crashed
ar: %1 تحطمت
gl: %1 quebrou

source: %1 finished with exit code %2
ar: %1 انتهى مع رمز الخروج %2
gl: %1 rematou co estado de saída %2

source: Starts the external tool '%1'
ar: يبدأ الأداة الخارجية '%1'
gl: Inicia a ferramenta externa «%1»

source: Edit External Tool
ar: حرر الأداة الخارجية
gl: Editar a ferramenta externa

source: Revert tool to default settings
ar: أعد ضبط الأداة إلى الإعدادات المبدئية
gl: Reverter a ferramenta á configuración predeterminada

source: External Tool
ar: أداة خارجية
gl: Ferramenta externa

source: You must specify at least a name and an executable
ar: يجب عليك تحديد اسم على الأقل وقابل للتنفيذ
gl: Debe indicar polo menos un nome e un executábel.

source: With 'Trigger' enabled, at least one mimetype needs to be specified.
ar: مع تمكين "المطلق" ، يجب تحديد نوع واحد على الأقل.
gl: Se activa o «disparador», debe indicar polo menos un tipo MIME.

source: Select the MimeTypes for which to enable this tool.
ar: حدد أنواع MIME التي تريد تمكين هذه الأداة لها.
gl: Seleccione os tipos MIME para os que activar a ferramenta.

source: Select Mime Types
ar: اختر أنواع Mime
gl: Seleccione tipos MIME

source: Add Tool...
ar: أ&ضف أداة...
gl: Engadir unha ferramenta…

source: Add Tool from Defaults
ar: أضف أداة من المبدئيات
gl: Engadir unha das ferramentas predeterminadas

source: Add Category
ar: أضف صنفاً
gl: Engadir unha categoría

source: Uncategorized
ar: غير مصنف
gl: Sen categorizar

source: New Category
ar: صنف جديد
gl: Nova categoría

source: New Category %1
ar: صنف جديد %1
gl: Nova categoría %1

source: Configure...
ar: اضبط...
gl: Configurar…

source: Launch external helper applications
ar: إطلاق تطبيقات المساعد الخارجي
gl: Iniciar aplicacións externas de asistencia

source: Edit Tool
ar: حرر الأداة
gl: Editar a ferramenta

source: Na&me:
ar: الا&سم:
gl: No&me:

source: The name will be displayed in the 'Tools->External Tools' menu.
ar: سيعرض الاسم في قائمة "الأدوات-> الأدوات الخارجية".
gl: O nome amosarase no menú «Ferramentas → Ferramentas externas».

source: Short name of the tool
ar: الاسم القصير للأداة
gl: Nome curto da ferramenta

source: Executable:
ar: التنفيذي:
gl: Executábel:

source: Application or interpreter
ar: التطبيق أو المترجم
gl: Aplicación ou intérprete

source: Ar&guments:
ar: ال&معاملات:
gl: Ar&gumentos:

source: Command line arguments
ar: معاملات سطر الأوامر
gl: Argumentos da liña de ordes

source: &Input:
ar: ال&دّخل:
gl: &Entrada:

source: Optional standard input
ar: الإدخال القياسي الاختياري
gl: Entrada estándar opcional

source: Working directory:
ar: دليل العمل:
gl: Cartafol de traballo:

source: Uses current document path if empty
ar: يستخدم مسار المستند الحالي إذا كان فارغًا
gl: Úsase a ruta do documento actual se queda baleiro

source: Mime &types:
ar: أ&نواع MIME:
gl: &Tipos MIME:

source: A semicolon-separated list of mime types for which this tool should be available. If empty, the tool is always available.
ar: قائمة مفصولة بفاصلة منقوطة لأنواع mime التي يجب أن تكون هذه الأداة متاحة لها. إذا كانت فارغة، فستكون الأداة متاحة دائمًا.
gl: Unha lista de tipos MIME, separados por punto e coma (;), para os que a ferramenta debería estar dispoñíbel. Se se deixa baleiro, a ferramenta está sempre dispoñíbel.

source: Show tool only for given mime types
ar: أداة العرض فقط لأنواع mime المعطاة
gl: Só amosar a ferramenta para os tipos MIME indicados

source: Opens a dialog that helps in creating a list of mimetypes.
ar: يفتح مربع حوار يساعد في إنشاء قائمة من أنواع MIME.
gl: Abre un diálogo que axuda a crear unha lista de tipos MIME.

source: Save:
ar: الحفظ:
gl: Gardar:

source: Optionally save the current or all modified documents prior to running the command. This is helpful if you want to pass URLs to an application like, for example, an FTP client.
ar: يمكنك اختياريًا حفظ المستندات الحالية أو جميع المستندات المعدلة قبل تشغيل الأمر. وهذا مفيد إذا كنت تريد تمرير عناوين URL إلى تطبيق مثل، على سبيل المثال، عميل FTP.
gl: Opcionalmente, gardar o documento actual ou todos os modificados antes de executar esta orde. É útil se quere pasar uns URL a unha aplicación, como a un cliente de FTP.

source: None
ar: لا شيء
gl: Ningún

source: Current Document
ar: المستند الحاليّ
gl: Documento actual

source: All Documents
ar: كل المستندات
gl: Todos os documentos

source: Trigger
ar: المُطلق
gl: Disparador

source: Before Save
ar: قبل الحفظ
gl: Antes de gardar

source: After Save
ar: بعد الحفظ
gl: Despois de gardar

source: Reload current document after execution
ar: أعد تحميل المستند الحاليّ بعد التنفيذ
gl: Recargar o documento actual tras a execución

source: O&utput:
ar: ال&خرج:
gl: &Saída:

source: Ignore
ar: تجاهل
gl: Ignorar

source: Insert at Cursor Position
ar: أدرج عند موضع المؤشر
gl: Inserir na posición do cursor

source: Replace Selected Text
ar: استبدل النص المحدد
gl: Substituír o texto seleccionado

source: Replace Current Document
ar: استبدل المستند الحاليّ
gl: Substituír o documento actual

source: Append to Current Document
ar: ألحق بالمستند الحاليّ
gl: Engadir ao documento actual

source: Insert in New Document
ar: أدرِج في مستند جديد
gl: Inserir nun novo documento

source: Copy to Clipboard
ar: انسخ إلى الحافظة
gl: Copiar no portapapeis

source: Display in Pane
ar: عرض في الجزء
gl: Amosar no panel

source: Editor command:
ar: أمر المحرّر:
gl: Orde do editor:

source: If you specify a name here, you can invoke the command from the view command line with the_name_you_specified_here. Please do not use spaces or tabs in the name.
ar: إذا حددت اسم هنا ، فيمكنك استدعاء الأمر من سطر أوامر العرض مع the_name_you_specified_here. يرجى عدم استخدام المسافة أو تبويبات في الاسم.
gl: Se indica un nome aquí, pode invocar unha orde desde a liña de ordes da vista co nome que indique aquí. Non use espazos nin tabulacións no nome.

source: Optional view command line name
ar: اسم سطر أوامر العرض الاختياري
gl: Nome opcional da liña de ordes da vista

source: Output
ar: الخرج
gl: Saída

source: Displays output from the external tool
ar: يعرض الإخراج من الأداة الخارجية
gl: Amosa a saída da ferramenta externa

source: &Tools
ar: أ&دوات
gl: Ferramen&tas

source: Main Toolbar
ar: شريط الأدوات الرئيسي
gl: Barra de ferramentas principal
