Repository: KDE/kate
Catalog: po/*/kategpgplugin.po
Languages: ar, ca@valencia, de, es, ia, it, nl, tr, zh_cn, zh_tw

source: Error! No keys found...
ar: خطأ! لا مفاتيح عُثر عليها...
ca@valencia: Error! No s'ha trobat cap clau…
de: Fehler! Keine Schlüssel gefunden …
es: Error: No se han encontrado claves…
ia: Error! Nulle clave trovate...
it: Errore! Nessuna chiave trovata...
nl: Fout! Geen sleutels gevonden...
tr: Hata! Bulunan anahtar yok.
zh_cn: 错误！找不到密钥...
zh_tw: 錯誤！沒有找到金鑰…

source: Error finding key:
ar: خطأ في العثور على المفتاح:
ca@valencia: S'ha produït un error en buscar la clau:
de: Fehler beim Finden des Schlüssels:
es: Error al buscar clave:
ia: Error quando on trovava clave:
it: Errore nel trovare la chiave:
nl: Fout bij zoeken naar sleutel:
tr: Anahtar bulunurken hata:
zh_cn: 查找密钥时出错：
zh_tw: 尋找金鑰時發生錯誤：

source: Error in symmetric encryption:
ar: خطأ في التعمية المتناظرة:
ca@valencia: S'ha produït un error en l'encriptació simètrica:
de: Fehler bei der symmetrischen Verschlüsselung:
es: Error de cifrado simétrico:
ia: Error in cryptation symmetric:
it: Errore nella cifratura simmetrica:
nl: Fout in symmetrische versleuteling:
tr: Simetrik şifrelemede hata:
zh_cn: 对称加密错误：
zh_tw: 對稱加密錯誤：

source: Encryption Failed:
ar: فشل التعمية:
ca@valencia: No s'ha pogut fer l'encriptació:
de: Verschlüsseln fehlgeschlagen:
es: El cifrado ha fallado:
ia: Cryptation falleva:
it: Cifratura non riuscita:
nl: Versleutelen is mislukt:
tr: Şifreleme başarısız:
zh_cn: 加密失败：
zh_tw: 加密失敗：

source: GPG Plugin
ar: ملحقة GPG
ca@valencia: Connector GPG
de: GPG-Modul
es: Complemento GPG
it: Estensione GPG
tr: GPG Eklentisi
zh_cn: GPG 插件
zh_tw: GPG 外掛程式

source: GPG Decrypt current document
ar: فك التعمية GPG للمستند الحالي
ca@valencia: GPG desencripta el document actual
de: Aktuelles Dokument mit GPG entschlüsseln
es: Descifrar el documento actual con GPG
ia: GPG Decrypta Documento currente
it: GPG Decifra il documento attuale
nl: GPG-ontcijferen van huidige document
tr: Geçerli Belgenin Şifresini GPG ile Çöz
zh_cn: GPG 解密当前文档
zh_tw: GPG 解密目前文件

source: GPG Encrypt current document
ar: تعمية GPG للمستند الحالي
ca@valencia: GPG encripta el document actual
de: Aktuelles Dokument mit GPG verschlüsseln
es: Cifrar el documento actual con GPG
ia: GPG Crypta Documento currente
it: GPG Cifra il documento attuale
nl: GPG-versleutel huidig document
tr: Geçerli Belgeyi GPG ile Şifrele
zh_cn: GPG 加密当前文档
zh_tw: GPG 加密目前文件

source: <b>GPG Plugin Settings</b>
ar: <b>إعدادات ملحقة GPG</b>
ca@valencia: <b>Configureu el connector GPG</b>
de: <b>GPG-Moduleinstellungen</b>
es: <b>Preferencias del complemento GPG</b>
ia: <b>Preferentias de Plugin de GPG</b>
it: <b>Impostazioni dell'estensione GPG</b>
nl: <b>GPG-plug-in instellingen</b>
tr: <b>GPG Eklentisi Ayarları</b>
zh_cn: <b>GPG 插件设置</b>
zh_tw: <b>GPG 外掛程式設定</b>

source: Key ID
ar: معرف المفتاح
ca@valencia: ID de la clau
de: Schlüssel-ID
es: ID de la clave
ia: ID de clave
it: ID chiave
nl: Sleutel-ID
tr: Anahtar kimliği
zh_cn: 密钥 ID
zh_tw: 金鑰 ID

source: A search string used to filter keys by available email addresses
ar: سلسلة بحث تستخدم لتصفية المفاتيح حسب عناوين البريد الإلكتروني المتوفرة
ca@valencia: Una cadena de busca utilitzada per a filtrar claus per adreces disponibles de correu electrònic
de: Eine Suchzeichenkette, um Schüssel nach verfügbaren E-Mail-Adressen zu filtern
es: Cadena de búsqueda usada para filtrar claves por direcciones de correo electrónico disponibles
ia: Un catena de cerca usate per filtrar claves per adresses de e-posta disponibile
it: Una stringa di ricerca utilizzata per filtrare le chiavi in ​​base agli indirizzi di posta disponibili
nl: Een zoektekenreeks gebruikt om trefwoorden te filteren op beschikbare e-mailadressen
tr: Kullanılabilir e-posta adresleri arasından anahtarları süzmek için kullanılan bir arama dizisi
zh_cn: 用于通过可用电子邮件地址筛选密钥的搜索字符串
zh_tw: 用來依可用電子郵件地址過濾金鑰的搜尋字串

source: Selected GPG Key finerprint for encryption
ar: بصمة مفتاح GPG المختار للتعمية
ca@valencia: Empremta digital de la clau GPG seleccionada per a l'encriptació
de: Für die Verschlüsselung ausgewählter GPG-Fingerabdruck
es: Huella digital de la clave GPG seleccionada para cifrar
ia: Impression digital de clave de GPG seligite per cryptation
it: Impronta digitale della chiave GPG selezionata per la cifratura
nl: Geselecteerde vingerafdruk van GPG-sleutel voor versleuteling
tr: Şifreleme için seçili GPG anahtar parmak izi
zh_cn: 选择用于加密的 GPG 密钥指纹
zh_tw: 加密用的所選 GPG 金鑰指紋

source: <b>To: Email address used for encryption</b>
ar: <b>إلى: عنوان البريد الإلكتروني المستخدم للتعمية</b>
ca@valencia: <b>A: Adreça de correu electrònic utilitzada per a l'encriptació</b>
de: <b>An: E-Mail-Adresse, die für die Verschlüsselung verwendet wird</b>
es: <b>Para: dirección de correo usada para cifrar</b>
ia: <b>A: Adresse de e-posta usate per cryptation</b>
it: <b>A: Indirizzo di posta utilizzato per la cifratura</b>
nl: <b>Aan: e-mailadres gebruikt voor versleuteling</b>
tr: <b>Kime:</b> Şifreleme için kullanılan e-posta adresi
zh_cn: <b>收件人：用于加密的电子邮件地址</b>
zh_tw: <b>加密用的收件者電子郵件</b>

source: Select an email address to which to encrypt. Only mail addresses associated with your currently selected key fingerprint are available.
ar: اختر عنوان بريد إلكتروني للتعمية إليه. فقط عناوين البريد المرتبطة ببصمة المفتاح المختارة حالياً متوفرة.
ca@valencia: Trieu una adreça de correu electrònic a la qual encriptar. Només estaran disponibles les adreces de correu associades amb l'empremta digital de la clau seleccionada actualment.
de: Wählen Sie eine E-Mail-Adresse für die Verschlüsselung aus. Es sind nur die E-Mail-Adressen verfügbar, die mit dem ausgewählten Schlüssel-Fingerabdruck verknüpft sind.
es: Seleccione una dirección de correo para la que se cifrará. Solo están disponibles las direcciones de correo asociadas con la huella digital seleccionada.
ia: Selige un adresse de e-posta al qual cryptar. Solmente adresses de e-posta associate con tu impression digital de clave es disponibile.
it: Seleziona un indirizzo di posta dal quale cifrare. Sono disponibili solo gli indirizzi di posta associati all'impronta digitale della chiave attualmente selezionata.
nl: Selecteer een e-mailadres waarnaar te versleutelen. Alleen e-mailadressen behorende bij uw nu geselecteerde vingerafdruk van sleutel zijn beschikbaar.
tr: Kendisine şifrelenecek bir e-posta adresi seçin. Yalnızca şu anda seçili anahtar parmak izinizle ilişkilendirilmiş e-posta adresleri kullanılabilirdir.
zh_cn: 请选择要加密的电子邮件地址。 只有与您当前所选密钥指纹相关联的电子邮件地址可用。
zh_tw: 選取要加密給哪個電子郵件地址。 只能選取與您目前所選金鑰的指紋有相關的電子郵件地址。

source: This is your currently selected GPG key fingerprint that will be used for encryption.
ar: هذه هي بصمة مفتاح GPG المختارة حالياً والتي ستستخدم للتعمية.
ca@valencia: Esta és la vostra empremta digital de la clau GPG seleccionada que s'utilitzarà per a l'encriptació.
de: Das ist der aktuell ausgewählte GPG-Schlüssel-Fingerabdruck, der für die Verschlüsselung verwendet wird.
es: Esta es su huella digital de clave GPG seleccionada actualmente para usar al cifrar.
ia: Isto es tu currentemente seligite impression digital de clave GPG que essera usate per cryptation.
it: Questa è l'impronta digitale della chiave GPG attualmente selezionata che sarà utilizzata per la cifratura.
nl: Dit is uw nu geselecteerde vingerafdruk van de GPG-sleutel die gebruikt zal worden voor versleuteling.
tr: Bu, şu anda seçili olan ve şifreleme için kullanılacak GPG anahtarınızdır.
zh_cn: 这是您当前选择的用于加密的 GPG 密钥指纹。
zh_tw: 這是您目前選取的 GPG 金鑰指紋，會用於加密。

source: Save as ASCII encoded (.asc/.gpg)
ar: احفظ كترميز ASCII (الإسكي) (.asc/.gpg)
ca@valencia: Anomena i guarda codificat ASCII (.asc/.gpg)
de: Als ASCII-kodiert speichern (.asc/.gpg)
es: Guardar como codificación ASCII (.asc/.gpg)
ia: Salveguarda como codificate ASCII (.asc/.gpg)
it: Salva come codificato ASCII (.asc/.gpg)
nl: Opslaan als ASCII gecodeerd (.asc/.gpg)
tr: ASCII kodlu olarak kaydet (.asc/.gpg)
zh_cn: 另存为 ASCII 编码文件 (.asc/.gpg)
zh_tw: 儲存為 ASCII 編碼 (.asc/.gpg)

source: Enable symmetric encryption
ar: فعّل التعمية المتناظرة
ca@valencia: Activa l'encriptació simètrica
de: Symmetrische Verschlüsselung aktivieren
es: Activar cifrado simétrico
ia: Habilita cryptation symmetric
it: Abilita la cifratura simmetrica
nl: Symmetrische versleuteling
tr: Simetrek şifrelemeyi etkinleştir
zh_cn: 启用对称加密
zh_tw: 啟用對稱加密

source: Show only keys for which a private key is available
ar: أظهر المفاتيح التي يتوفر لها مفتاح خاص فقط
ca@valencia: Mostra només les claus per a les quals hi ha disponible una clau privada
de: Nur die Schlüssel anzeigen, für die ein privater Schlüssel verfügbar ist
es: Mostrar solo las claves con una clave privada disponible
ia: Monstra solmente claves per le qual es disponibile un clave private
it: Mostra solo le chiavi per le quali è disponibile una chiave privata
nl: Toon alleen sleutels waarvoor en private sleutel beschikbaar is
tr: Yalnızca kullanılabilir bir özel anahtarı olan anahtarları göster
zh_cn: 仅显示有可用私钥的密钥
zh_tw: 只顯示私鑰可用的金鑰

source: Hide Expired Keys
ar: أخفِ المفاتيح المنتهية الصلاحية
ca@valencia: Oculta les claus vençudes
de: Abgelaufene Schlüssel ausblenden
es: Ocultar las claves que han expirado
ia: Cela claves expirate
it: Nascondi le chiavi scadute
nl: Verlopen sleutels verbergen
tr: Süresi dolmuş anahtarları gizle
zh_cn: 隐藏过期密钥
zh_tw: 隱藏已過期的金鑰

source: Attempted double encryption detected! Encrypting more than once is disabled for now...
ar: اكتشف محاولة تعمية مزدوجة! تعمية أكثر من مرة معطلة حالياً...
ca@valencia: S'ha detectat un intent d'encriptació doble! L'encriptació més d'una vegada està desactivat de moment…
de: Versuch doppelter Verschlüsselung festgestellt! Aktuell ist mehrfache Verschlüsselung deaktiviert …
es: Se ha detectado un intento de doble cifrado. En la actualidad no se puede cifrar más de una vez…
ia: Discoperite duple cryptation essayate Cryptar plus que un vice es dishabilitate per le momento...
it: Rilevato tentativo di doppia cifratura!Per ora, la cifratura multipla è disabilitata...
nl: Poging voor dubbele versleuteling gedetecteerd! Meer dan eens versleutelen is voor nu uitgeschakeld...
tr: Çifte şifreleme denemesi algılandı! Birden çok şifreleme şu an için devre dışıdır.
zh_cn: 检测到尝试双重加密！ 目前禁用多次加密功能……
zh_tw: 已偵測到嘗試進行雙重加密！ 目前無法加密超過一次…

source: Error! No views available...
ar: خطأ! لا عروض متوفرة...
ca@valencia: Error! No hi ha vistes disponibles…
de: Fehler! Keine Ansichten verfügbar …
es: Error: No hay vistas disponibles…
ia: Error! Nulle vistas disponibile...
it: Errore! Nessuna vista disponibile...
nl: Fout! Geen weergaven beschikbaar...
tr: Hata! Kullanılabilir görünüm yok.
zh_cn: 错误！没有可用的视图...
zh_tw: 錯誤！沒有可用的檢視…

source: Error Decrypting Text! Document is empty...
ar: خطأ في فك التعمية للنص! المستند فارغ...
ca@valencia: S'ha produït un error en desencriptar el text! El document està buit…
de: Fehler bei der Textentschlüsselung! Das Dokument ist leer …
es: Error al descifrar texto: El documento está vacío.
ia: Error Decryptante texto! Documento es vacue...
it: Errore durante la decifratura del testo! Il documento è vuoto...
nl: Fout bij ontcijferen van tekst! Document is leeg...
tr: Metin şifresi çözülürken hata! Belge boş.
zh_cn: 解密文本时出错！文档为空...
zh_tw: 解密文字時發生錯誤！文件是空的…

source: Error Decrypting Text! No fingerprint selected...
ar: خطأ في فك التعمية للنص! لا يوجد بصمة مختارة...
ca@valencia: S'ha produït un error en desencriptar el text! No s'ha seleccionat cap empremta digital…
de: Fehler bei der Textentschlüsselung! Kein Fingerabdruck ausgewählt …
es: Error al descifrar texto: No se ha seleccionado ninguna huella digital.
ia: Error Decryptante Texto! Nulle Impression Digital seligite...
it: Errore durante la decifratura del testo! Nessuna impronta digitale selezionata...
nl: Fout bij ontcijferen van tekst! Geen vingerafdruk geselecteerd...
tr: Metin şifresi çözülürken hata! Seçili parmak izi yok.
zh_cn: 解密文本时出错！没有选择指纹...
zh_tw: 解密文字時發生錯誤！未選取指紋…

source: Error Decrypting Text! No matching fingerprint found! Or this is not a GPG encrypted text...
ar: خطأ في فك التعمية للنص! لا يوجد بصمة مطابقة عُثر عليها! أو هذا ليس نصاً معمّى بـ GPG...
ca@valencia: S'ha produït un error en desencriptar el text! No s'ha trobat cap empremta digital coincident! O açò no és un text encriptat amb GPG…
de: Fehler bei der Textentschlüsselung! Kein passender Fingerabdruck gefunden! Möglicherweise ist dies kein GPG-verschlüsselter Text …
es: Error al descifrar texto: No se ha encontrado ninguna huella digital coincidente. O este texto no está cifrado con GPG.
ia: Error Decryptante Texto! Nulle Impression Digital correspondente trovate! O isto non es un texto crypytate GPG...
it: Errore durante la decifratura del testo! Nessuna impronta digitale corrispondente trovata! Oppure questo non è un testo cifrato con GPG...
nl: Fout bij ontcijferen van tekst! Geen overeenkomende vingerafdruk gevonden! Of dit is geen GPG versleutelde tekst...
tr: Metin şifresi çözülürken hata! Eşleşen parmak izi bulunamadı veya bu GPG ile şifrelenmiş bir metin değil.
zh_cn: 解密文本时出错！没有找到匹配的指纹！ 或者这不是 GPG 加密文本...
zh_tw: 解密文字時發生錯誤！ 沒有找到相符的指紋！ 或許這不是 GPG 加密的文字…

source: Error Decrypting Text!
ar: خطأ في فك التعمية للنص!
ca@valencia: S'ha produït un error en desencriptar el text!
de: Fehler bei der Textentschlüsselung!
es: Error al descifrar texto.
ia: Error Decryptante texto!
it: Errore durante la decifratura del testo!
nl: Fout bij ontcijferen van tekst!
tr: Metin şifresi çözülürken hata!
zh_cn: 解密文本时出错！
zh_tw: 解密文字時發生錯誤！

source: Error Encrypting Text! No document available...
ar: خطأ في تعمية النص! لا يوجد مستند متوفر...
ca@valencia: S'ha produït un error en encriptar el text! No hi ha cap document disponible…
de: Fehler bei der Textverschlüsselung! Kein Dokument verfügbar …
es: Error al cifrar texto: Ningún documento disponible.
ia: Error Cryptante Texto! Nulle documento disponibile...
it: Errore durante la cifratura del testo! Nessun documento disponibile...
nl: Fout bij ontcijferen van tekst! Geen document beschikbaar...
tr: Metin şifresi çözülürken hata! Kullanılabilir belge yok.
zh_cn: 加密文本时出错！没有可用的文档...
zh_tw: 加密文字時發生錯誤！沒有可用的文件…

source: Error Encrypting Text! Document is empty...
ar: خطأ في تعمية النص! المستند فارغ...
ca@valencia: S'ha produït un error en encriptar el text! El document està buit…
de: Fehler bei der Textverschlüsselung! Das Dokument ist leer …
es: Error al cifrar texto: El documento está vacío.
ia: Error Cryptante texto! Documento es vacue...
it: Errore durante la cifratura del testo! Nessun documento disponibile...
nl: Fout bij ontcijferen van tekst! Document is leeg...
tr: Metin şifresi çözülürken hata! Belge boş.
zh_cn: 加密文本时出错！文档为空...
zh_tw: 加密文字時發生錯誤！文件是空的…

source: Error Encrypting Text! No fingerprint selected...
ar: خطأ في تعمية النص! لا يوجد بصمة مختارة...
ca@valencia: S'ha produït un error en encriptar el text No s'ha seleccionat cap empremta digital…
de: Fehler bei der Textverschlüsselung! Es wurde kein Fingerabdruck ausgewählt …
es: Error al cifrar texto: Ninguna huella digital seleccionada.
ia: Error Cryptante Texto! Nulle Impression Digital seligite...
it: Errore durante la cifratura del testo!Nessuna impronta digitale selezionata...
nl: Fout bij ontcijferen van tekst! Geen vingerafdruk geselecteerd...
tr: Metin şifresi çözülürken hata! Seçili parmak izi yok.
zh_cn: 加密文本时出错！ 没有选择指纹...
zh_tw: 加密文字時發生錯誤！ 未選取指紋…

source: Attempted double encryption detected! Encrypting twice is disabled for now...
ar: اكتشف محاولة تعمية مزدوجة! تعمية مرتين معطلة حالياً...
ca@valencia: S'ha detectat un intent de xifratge doble! Encriptar dues vegades està desactivat per ara…
de: Versuch doppelter Verschlüsselung festgestellt! Aktuell ist die zweifache Verschlüsselung deaktiviert …
es: Se ha detectado un intento de cifrado doble: En la actualidad no se puede cifrar dos veces.
ia: Discoperite duple cryptation essayate!Cryptar due vices es dishabilitate per le momento...
it: Rilevato tentativo di doppia cifratura! Per ora la doppia cifratura è disabilitata...
nl: Poging voor dubbele versleuteling gedetecteerd! Meer dan eens versleutelen is voor nu uitgeschakeld...
tr: Çifte şifreleme denemesi algılandı! Bu özellik, şu an için devre dışıdır.
zh_cn: 尝试双重加密！当前已禁用两次加密...
zh_tw: 已偵測到嘗試進行雙重加密！目前無法加密兩次…

source: Error Encrypting Text! No Matching Fingerprint found...
ar: خطأ في تعمية النص! لا يوجد بصمة مطابقة عُثر عليها...
ca@valencia: S'ha produït un error en encriptar el text! No s'ha trobat cap empremta digital coincident…
de: Fehler bei der Textverschlüsselung! Kein passender Fingerabdruck gefunden …
es: Error al cifrar texto: No se ha encontrado ninguna huella digital coincidente.
ia: Error Cryptante Texto! Nulle Impression Digital correspondente trovate ...
it: Errore durante la cifratura del testo! Nessuna impronta digitale corrispondente trovata...
nl: Fout bij versleutelen van tekst! Geen overeenkomende vingerafdruk gevonden...
tr: Metin şifresi çözülürken hata! Eşleşen parmak izi bulunamadı.
zh_cn: 加密文本时出错！找不到匹配指纹...
zh_tw: 加密文字時發生錯誤！沒有找到相符的指紋…

source: Error Encrypting Text!
ar: خطأ في تعمية النص!
ca@valencia: S'ha produït un error en encriptar el text!
de: Fehler bei der Textverschlüsselung!
es: Error al descifrar texto
ia: Error Cryptante texto!
it: Errore durante la cifratura del testo!
nl: Fout bij ontcijferen van tekst!
tr: Metin şifresi çözülürken hata!
zh_cn: 加密文本时出错！
zh_tw: 加密文字時發生錯誤！

source: Key Fingerprint
ar: بصمة المفتاح
ca@valencia: Empremta digital de la clau
de: Schlüssel-Fingerabdruck
es: Huella digital de la clave
ia: Impression digital de Clave
it: Impronta digitale della chiave
nl: Vingerafdruk van sleutel
tr: Anahtar parmak izi
zh_cn: 密钥指纹
zh_tw: 金鑰指紋

source: Creation Date
ar: تاريخ الإنشاء
ca@valencia: Data de creació
de: Erstellungsdatum
es: Fecha de creación
ia: Data de creation
it: Data di creazione
nl: Aanmaakdatum
tr: Oluşturulma tarihi
zh_cn: 创建日期
zh_tw: 建立日期

source: Expiry Date
ar: تاريخ الانتهاء
ca@valencia: Data de venciment
de: Ablaufdatum
es: Fecha de caducidad
ia: Expira Data
it: Data di scadenza
nl: Verloopdatum
tr: Son kullanım tarihi
zh_cn: 过期日期
zh_tw: 過期日期

source: Key Length
ar: طول المفتاح
ca@valencia: Llargària de la clau
de: Schlüssel-Länge
es: Longitud de la clave
ia: Longitude de Clave
it: Lunghezza della chiave
nl: Sleutellengte
tr: Anahtar uzunluğu
zh_cn: 密钥长度
zh_tw: 金鑰長度

source: User IDs
ar: مُعرِّفات المستخدمين
ca@valencia: Els ID d'usuari
de: Benutzerkennungen
es: ID de usuario
ia: IDs de usator
it: ID utente
nl: Gebruiker-id's
tr: Kullanıcı kimlikleri
zh_cn: 用户 ID
zh_tw: 使用者 ID
