Repository: KDE/kate
Catalog: po/*/katebuild-plugin.po
Languages: de, ga, ia, ko, pt, tr, zh_tw

# NAME OF TRANSLATORS
source: Your names
de: Deutsches KDE-Übersetzungsteam
ga: Kevin Scannell
ia: Giovanni Sora
ko: 박신조
pt: César A. P. Cláudio, José Nuno Pires
tr: Serdar Soytetir, Volkan Gezer, Emir SARI
zh_tw: Jeff Huang, Kisaragi Hiu

# EMAIL OF TRANSLATORS
source: Your emails
de: kde-i18n-de@kde.org
ga: kscanne@gmail.com
ia: g.sora@tiscali.it
ko: kde@peremen.name
pt: cesarapclaudio@gmail.com, zepires@gmail.com
tr: tulliana@gmail.com, volkangezer@gmail.com, emir_sari@icloud.com
zh_tw: s8321414@gmail.com, mail@kisaragi-hiu.com

source: Output
de: Ausgabe
ga: Aschur
ia: Exito
ko: 출력
pt: Resultado
tr: Çıktı
zh_tw: 輸出

source: Build Again
de: Erneut erstellen
ga: Breiseán TógálaTóg Arís
ia: Construe de novo
ko: 다시 빌드
pt: Compilar novamente
tr: Yeniden Yap
zh_tw: 再次編譯

source: Cancel
de: Abbrechen
ga: Cealaigh
ia: Cancella
ko: 취소
pt: Cancelar
tr: İptal
zh_tw: 取消

source: Build & Run
de: Erstellen & Ausführen
ga: Breiseán TógálaTóg & Rith
ia: Construe & Exeque
ko: 빌드하고 실행
pt: Compilar e executar
tr: Yap ve Çalıştır
zh_tw: 編譯與執行

source: Build & Run Settings
de: Einstellungen für „Erstellen & Ausführen“
ga: Socruithe Tógála & Rith
ia: Preferentias de Construe e Exeque
ko: 빌드하고 실행 설정
pt: Definições de compilação e execução
tr: Ayarları Yap ve Çalıştır
zh_tw: 編譯與執行設定

source: Delete selected entries
de: Ausgewählte Einträge löschen
ga: Socraithe Tógála & Rith
ia: Dele entratas seligite
ko: 선택한 항목 삭제
pt: Eliminar entradas selecionadas
tr: Seçili Girdileri Sil
zh_tw: 刪除選取的項目

source: Delete all entries
de: Alle Einträge löschen
ga: Scrios gach iontráil
ia: Dele omne entratas
ko: 모든 항목 삭제
pt: Eliminar todas as entradas
tr: Tüm Girdileri Sil
zh_tw: 刪除所有項目

source: General Settings
de: Allgemeine Einstellungen
ga: Socruithe Ginearálta
ia: Preferentias General
ko: 일반 설정
pt: Definições gerais
tr: Genel Ayarlar
zh_tw: 一般設定

source: Add errors and warnings to Diagnostics
de: Fehler und Warnungen zur Fehlerdiagnose hinzufügen
ga: Cuir earráidí agus rabhaidh le Diagnóisic
ia: Adde errores e avisos a Diagnostica
ko: 진단에 오류와 경고 추가
pt: Adicionar erros e avisos aos Diagnósticos
tr: Tanılara hataları ve uyarıları ekle
zh_tw: 將錯誤與警告加入診斷

source: Automatically switch to output pane on executing the selected target
de: Bei der Ausführung des ausgewählten Ziels automatisch zum Ausgabefenster wechseln
ga: Athraigh go huathoibríoch go dtí an painéal aschuir nuair a bhíonn an sprioc roghnaithe á fhorghníomhú
ia: Commuta automaticamente a vitro de exito quando on executa le objectivo selectionate
ko: 선택한 대상을 실행할 때 자동으로 출력 패널로 전환
pt: Mudar automaticamente para o painel de saída ao executar o alvo selecionado
tr: Seçili hedefi yürütürken kendiliğinden çıktı bölmesine geç
zh_tw: 執行選取目標時自動切換至輸出面板

source: If the output lines start with [ # / ## ] or [ ## % ], display the latest as a message.
de: Wenn die Ausgabezeilen mit [ # / ## ] oder [ ## % ] starten, die letzte als Meldung anzeigen.
ga: Má thosaíonn na línte aschuir le [ # / ## ] nó [ ## % ], taispeánfar an ceann is déanaí mar theachtaireacht.
ia: Si le lineas de exito starta con [ # / ## ] o [ ## % ], monstra le ultime como un message.
ko: 출력 줄이 [ # / ##] 또는 [ ## % ] 문자열로 시작하면 맨 마지막 출력을 메시지로 표시합니다.
pt: Se as linhas de saída começarem com [ # / ## ] ou [ ## % ], mostrar a mais recente como uma mensagem.
tr: Çıktı satırları [ # / ## ] veya [ ## % ] ile başlıyorsa en son veriyi ileti olarak görüntüleyin.
zh_tw: 如果輸出行數以 [ # / ## ] 或 [ ## % ]（假設「#」是數字），則將最新的輸出行以訊息方式顯示出來。

source: Show build progress as a message when the output pane is hidden
de: Wenn das Ausgabefenster versteckt ist, den Fortschritt des Erstellens als eine Meldung anzeigen
ga: Taispeáin dul chun cinn na tógála mar theachtaireacht nuair a bhíonn an painéal aschuir i bhfolach
ia: Monstra progresso de construir comoiun message quando le quasro de exito es celate
ko: 출력 패널을 숨겼을 때 빌드 진행 상황을 메시지로 표시
pt: Mostrar o progresso da compilação como uma mensagem quando o painel de saída estiver oculto
tr: Çıktı paneli gizliyken yapı ilerlemesini ileti olarak göster
zh_tw: 輸出面板隱藏時以訊息方式顯示編譯進度

source: Allowed && Blocked Commands
de: Erlaubte und nicht erlaubte Befehle
ga: Orduithe Ceadaithe && Blocáilte
ia: Commandos Permittite && Blocate
ko: 허용 및 차단된 명령
pt: Comandos permitidos e bloqueados
tr: İzin Verilen ve Engellenen Komutlar
zh_tw: 允許與封鎖的指令

source: Build
de: Erstellen
ga: Tóg
ia: Construe
ko: 빌드
pt: Compilar
tr: Yap
zh_tw: 編譯

source: Select Target...
de: Ziel auswählen …
ga: Roghnaigh Sprioc...
ia: Selige objectivo ...
ko: 대상 선택...
pt: Selecionar alvo...
tr: Hedef Seç…
zh_tw: 選擇目標...

source: Build Selected Target
de: Ausgewähltes Ziel erstellen
ga: Tóg Sprioc Roghnaithe
ia: Construe objectivo seligite
ko: 선택한 대상 빌드
pt: Compilar alvo selecionado
tr: Seçili Hedefi Yap
zh_tw: 編譯選取的目標

source: Build and Run Selected Target
de: Ausgewähltes Ziel erstellen und ausführen
ga: Tóg agus Rith Sprioc Roghnaithe
ia: Construe e exeque objectivo seligite
ko: 선택한 대상 빌드 후 실행
pt: Compilar e executar alvo selecionado
tr: Seçili Hedefi Yap ve Çalıştır
zh_tw: 編譯並執行選取的目標

source: Compile Current File
de: Aktuelle Datei kompilieren
ga: Tiomsaigh an Comhad Reatha
ia: Compila File Currente
ko: 현재 파일 컴파일
pt: Compilar ficheiro atual
tr: Geçerli Dosyayı Derle
zh_tw: 編譯目前檔案

source: Try to compile the current file by searching a compile_commands.json
de: Nach compile_commands.json suchen, um die aktuelle Datei kompilieren zu können
ga: Déan iarracht an comhad reatha a thiomsú trí chuardach a dhéanamh ar compile_commands.json
ia: Essaya compilar le file currente per cercar un compile_commands.json
ko: compile_commands.json 파일을 검색하여 현재 파일 컴파일 시도
pt: Tentar compilar o ficheiro atual ao procurar um 'compile_commands.json'
tr: Bir compile_commands.json dosyası arayarak geçerli dosyayı derlemeyi dene
zh_tw: 嘗試搜尋 compile_commands.json 檔案來編譯目前檔案

source: Stop
de: Anhalten
ga: Stad
ia: Stoppa
ko: 정지
pt: Parar
tr: Durdur
zh_tw: 停止

source: Load targets from CMake Build Dir
de: Ziele aus dem CMake-Build-Ordner laden
ga: Luchtaigh spriocanna ó CMake Build Dir
ia: Carga Objectivos ex CMake Build Dir
ko: CMake 빌드 디렉터리에서 대상 불러오기
pt: Carregar alvos do diretório de compilação do CMake
tr: CMake Hedef Dizininden Hedefler Yükle
zh_tw: 從 CMake 編譯目錄載入目標

# Left is also left in RTL mode
source: Focus Next Tab to the Left
de: Nächstes Unterfenster links aktivieren
ga: Dírigh ar an gCluaisín Eile ar Chlé
ia: Focus al proxime scheda al sinistra
ko: 왼쪽에 있는 탭에 포커스 맞추기
pt: Focar o separador seguinte à esquerda
tr: Sonraki Sekmeyi Sola Odakla
zh_tw: 聚焦左方下一個分頁

# Right is right also in RTL mode
source: Focus Next Tab to the Right
de: Nächstes Unterfenster rechts aktivieren
ga: Fócas ar an gCluaisín Eile ar Dheis
ia: Focus al proxime scheda al dextera
ko: 오른쪽에 있는 탭에 포커스 맞추기
pt: Focar o separador seguinte à direita
tr: Sonraki Sekmeyi Sağa Odakla
zh_tw: 聚焦右方下一個分頁

# Tab label
source: Target Settings
de: Ziel-Einstellungen
ga: Socruithe Sprice
ia: Preferentias de objectivo
ko: 대상 설정
pt: Definições do alvo
tr: Hedef Ayarları
zh_tw: 目標設定

source: <b>File not found:</b> %1<br><b>Search paths:</b><br>%2<br>Try adding a search path to the "Working Directory"
de: <b>Datei nicht gefunden:</b> %1<br><b>Suchpfade:</b><br>%2<br>Fügen Sie einen Suchpfad zum Arbeitsordner hinzu
ga: <b>Comhad gan aimsiú:</b> %1<br><b>Conairí cuardaigh:</b><br>%2<br>Bain triail as cosán cuardaigh a chur leis an "Eolaire Oibre"
ia: <b>File non trovate:</b> %1<br><b>Percursos de cerca:</b><br>%2<br>Essaya adder un percurso d ecerca al "Directorio de Labor"
ko: <b>파일을 찾을 수 없음:</b>%1<br><b>검색 경로:</b><br>%2<br>"작업 디렉터리"에 검색 경로를 추가하십시오
pt: <b>Ficheiro não encontrado:</b> %1 <br><b>Caminhos de pesquisa:</b><br>%2<br>Experimente adicionar um caminho de pesquisa ao "Diretório de Trabalho"
tr: <b>Dosya bulunamadı:</b> %1<br><b>Arama yolları:</b><br>%2<br>“Çalışma Dizini”ne bir arama yolu eklemeyi deneyin
zh_tw: <b>找不到檔案：</b>%1<br><b>搜尋路徑：</b><br>%2<br>請試著新增「工作目錄」到搜尋路徑中

source: Build Information
de: Kompilierungs-Informationen
ga: Faisnéis Tógála
ia: Construe information
ko: 빌드 정보
pt: Informações da compilação
tr: Yapı Bilgisi
zh_tw: 編譯資訊

source: There is no file or directory specified for building.
de: Es ist keine Datei oder kein Ordner zum Erstellen angegeben.
ga: Níor sonraíodh comhad nó comhadlann ar bith le tógáil ann.
ia: Il non ha file o directorio specificate per construer.
ko: 빌드할 파일이나 디렉터리가 지정되지 않았습니다.
pt: Não foi especificado nenhum ficheiro ou diretório para a compilação.
tr: Derleme için herhangi bir dosya veya dizin belirtilmedi.
zh_tw: 找不到編譯需要的檔案或目錄。

source: The file "%1" is not a local file. Non-local files cannot be compiled.
de: Die Datei „%1“ ist keine lokale Datei. Nichtlokale Dateien können nicht kompiliert werden.
ga: Ní comhad logánta é "%1". Ní féidir comhaid neamhlogánta a thiomsú.
ia: Le file "%1" non es un file local. Files non local non pote esser compilate.
ko: 파일 "%1"이(가) 로컬 파일이 아닙니다. 로컬 파일만 컴파일할 수 있습니다.
pt: O ficheiro "%1" não é um ficheiro local. Ficheiros não locais não podem ser compilados.
tr: “%1” yerel bir dosya değil. Yerel olmayan dosyalar derlenemez.
zh_tw: 檔案 %1 不是本地檔案。無法編譯。

source: Create directory
de: Ordner erstellen
ga: Cruthaigh eolaire
ia: Crea directorio
ko: 디렉터리 만들기
pt: Criar diretório
tr: Dizin oluştur
zh_tw: 建立目錄

source: The configured working directory <b>%1</b> for the targetset <b>%2</b> does not exist.<br><br>Create the directory?
de: Der eingestellte Arbeitsordner <b>%1</b> für die Zielmenge <b>%2</b> existiert nicht.<br><br>Soll der Ordner erstellt werden?
ga: Níl an t-eolaire oibre cumraithe <b>%1</b> don tacar spriocanna <b>%2</b> ann.<br><br>An bhfuil tú ag iarraidh an t-eolaire a chruthú?
ia: Le directorio de labor configurate <b>%1</b> per le insin√¨mul de objectivo <b>%2</b> non existe.<br><br>Crea le directorio?
ko: 대상 세트 <b>%2</b>에 설정한 작업 디렉터리 <b>%1</b>이(가) 없습니다.<br><br>디렉터리를 생성하시겠습니까?
pt: O diretório de trabalho configurado <b>%1</b> para o conjunto de alvos <b>%2</b> não existe.Criar o diretório?
tr: <b>%2</b> hedefi için ayarlanmış yapılandırılan çalışma dizini <b>%1</b> yok.<br><br>Dizin oluşturulsun mu?
zh_tw: 為目標集 <b>%2</b> 設定使用的工作目錄 <b>%1</b> 不存在。<br><br>要建立該目錄嗎？

source: Failed to create the directory <b>%1</b>
de: Der Ordner <b>%1</b> kann nicht erstellt werden
ga: Theip ar chruthú an eolaire <b>%1</b>
ia: Il falleva a crear directorio <b>%1</b>
ko: <b>%1</b> 디렉터리를 생성할 수 없음
pt: Falha ao criar o diretório <b>%1</b>
tr: <b>%1</b> dizini oluşturulamadı
zh_tw: 建立目錄 <b>%1</b> 失敗

source: Failed to run "%1". exitStatus = %2
de: „%1“ kann nicht ausgeführt werden. exitStatus = %2
ga: Níorbh fhéidir "%1" a rith. Stádas scortha = %2
ia: Falleva a exequer "%1". Status de exito = %2
ko: "%1"을(를) 실행할 수 없습니다. 종료 상태 = %2
pt: Falha ao executar "%1". Código de saída (exitStatus) = %2
tr: “%1” çalıştırılamadı. Çıktı durumu = %2
zh_tw: 無法執行 %1。離開狀態為：%2

source: Building <b>%1: %2</b> cancelled
de: Das Erstellen von <b>%1: %2</b> wurde abgebrochen
ga: Foirgneamh <b>%1: %2</b> curtha ar ceal
ia: Cancellate construction <b>%1:%2</b>
ko: <b>%1:%2</b> 빌드 취소됨
pt: Compilação de <b>%1: %2</b> cancelada
tr: <b>%1: %2</b> yapımı iptal edildi
zh_tw: 已取消 <b>%1: %2</b> 的編譯

source: Did not find a compile_commands.json for file "%1".
de: compile_commands.json für Datei „%1“ nicht gefunden.
ga: Níor aimsíodh compile_commands.json don chomhad "%1".
ia: Il non trovava un compile_commands.json per le file "%1".
ko: "%1" 파일에 대한 compile_commands.json을 찾을 수 없습니다.
pt: Não foi encontrado um 'compile_commands.json' para o ficheiro "%1".
tr: “%1” dosyası için bir compile_commands.json dosyası bulunamadı.
zh_tw: 沒有找到檔案「%1」的 compile_commands.json。

source: Did not find a compile command for file "%1" in "%2".
de: Befehl für das Kompilieren der Datei „%1“ in „%2“ nicht gefunden.
ga: Níor aimsíodh ordú tiomsaithe don chomhad "%1" i "%2".
ia: Il non trovava un commando de compilar per le file "%1" in "%2".
ko: "%2"에서 "%1" 파일 컴파일 명령을 찾을 수 없습니다.
pt: Não foi encontrado um comando de compilação para o ficheiro "%1" em "%2".
tr: “%2” içinde “%1” dosyası için bir derleme komutu bulunamadı.
zh_tw: 在「%2」中沒有找到檔案「%1」的編譯命令。

source: Cannot make "%f" substitution. No open file or the current file is untitled!
de: Ersetzung „%f“ kann nicht durchgeführt werden, weil keine Datei offen ist oder die aktuelle Datei noch nicht unter einem Namen gespeichert ist.
ga: Ní féidir ionadú "%f" a dhéanamh. Níl aon chomhad oscailte nó níl teideal ar an gcomhad reatha!
ia: Non pote facer substitution de "%f". Necun file aperite o le file currente es sin titulo!
ko: "%f" 문자열을 대체할 수 없습니다. 열린 파일이 없거나 현재 파일이 아직 저장되지 않았습니다!
pt: Não foi possível efetuar a substituição de "%f". Nenhum ficheiro aberto, ou o ficheiro atual, está sem título!
tr: “%f” ikâmesi yapılamıyor. Tüm geçerli veya açık dosyaların bir başlığı var!
zh_tw: 無法進行 "%f" 取代。沒有開啟檔案，或者是目前檔案無名稱！

source: Cannot make "%d" substitution. No open file or the current file is untitled!
de: Ersetzung „%d“ kann nicht durchgeführt werden, weil keine Datei offen ist oder die aktuelle Datei noch nicht unter einem Namen gespeichert ist.
ga: Ní féidir ionadú "%d" a dhéanamh. Níl aon chomhad oscailte nó níl teideal ar an gcomhad reatha!
ia: Non pote facer substitution de "%d". Necun file aperite o le file currente es sin titulo!
ko: "%d" 문자열을 대체할 수 없습니다. 열린 파일이 없거나 현재 파일이 아직 저장되지 않았습니다!
pt: Não foi possível efetuar a substituição de "%d". Nenhum ficheiro aberto, ou o ficheiro atual, está sem título!
tr: “%d” ikâmesi yapılamıyor. Tüm geçerli veya açık dosyaların bir başlığı var!
zh_tw: 無法進行 "%d" 取代。沒有開啟檔案，或者是目前檔案無名稱！

source: Cannot make "%n" substitution. No open file or the current file is untitled!
de: Ersetzung „%n“ kann nicht durchgeführt werden, weil keine Datei offen ist oder die aktuelle Datei noch nicht unter einem Namen gespeichert ist.
ga: Ní féidir ionadú "%n" a dhéanamh. Níl aon chomhad oscailte nó níl teideal ar an gcomhad reatha!
ia: Non pote facer substitution "%n". Necun file aperite o le file currente es sin titulo!
ko: "%n" 문자열을 대체할 수 없습니다. 열린 파일이 없거나 현재 파일이 아직 저장되지 않았습니다!
pt: Não foi possível efetuar a substituição de "%n". Nenhum ficheiro aberto, ou o ficheiro atual, está sem título!
tr: “%n” ikâmesi yapılamıyor. Tüm geçerli veya açık dosyaların bir başlığı var!
zh_tw: 無法進行 "%n" 取代。沒有開啟檔案，或者是目前檔案無名稱！

source: Cannot make project substitution (%B). No open project!
de: Ersetzung im Projekt (%B) kann nicht durchgeführt werden, weil kein Projekt geöffnet ist.
ga: Ní féidir ionadú tionscadail a dhéanamh (%B). Níl aon tionscadal oscailte!
ia: Non pote facer substitution de projecto (%B). Necun projecto aperite!
ko: 프로젝트를 대체할 수 없습니다(%B). 열린 프로젝트가 없습니다!
pt: Não é possível efetuar a substituição do projeto (%B). Nenhum projeto aberto!
tr: Proje ikâmesi (%B) yapılamıyor. Açık proje yok!
zh_tw: 無法進行專案取代 (%B)。沒有開啟專案！

source: Already building...
de: Wird bereits erstellt …
ga: Ag tógáil cheana féin...
ia: Ja construente
ko: 이미 빌드 중...
pt: A compilar...
tr: Halihazırda yapılıyor…
zh_tw: 已經在編譯了...

source: Cannot execute: %1: %2 No working directory set. There is no local file or directory specified for building.
de: %1: %2 kann nicht ausgeführt werden. Kein Arbeitsordner wurde bestimmt. Es ist keine lokale Datei oder kein lokaler Ordner zum Erstellen angegeben.
ga: Ní féidir é a fhorghníomhú: %1: %2 Níl aon eolaire oibre socraithe. Níl aon chomhad nó eolaire áitiúil sonraithe le haghaidh tógála.
ia: Non pote exequer: %1:%2. Nulle directorio de travalio assignate. Il non ha file local o directorio specificate per construer.
ko: %1: %2을(를) 실행할 수 없습니다. 작업 디렉터리를 설정하지 않았습니다. 빌드할 로컬 파일이나 디렉터리가 지정되지 않았습니다.
pt: Não foi possível executar: %1: %2. Nenhum diretório de trabalho definido. Não foi especificado nenhum ficheiro ou diretório local para a compilação.
tr: Yürütülemiyor: %1: %2. Ayarlı çalışma dizini yok. Yapım için bir yerel dosya veya dizin belirtilmemiş.
zh_tw: 無法執行: %1: %2 沒有設定工作目錄。 找不到編譯需要的本地端檔案或目錄。

source: Building target <b>%1: %2</b> ...
de: Ziel <b>%1: %2</b> wird erstellt …
ga: Sprioc tógála <b>%1: %2</b> ...
ia: Construe objectivo <b>%1:%2</b> ...
ko: 대상 <b>%1: %2</b> 빌드 중...
pt: A compilar o alvo <b>%1: %2</b> ...
tr: <b>%1: %2</b> hedefi yapılıyor…
zh_tw: 編譯目標 <b>%1: %2</b> 中...

source: Cannot load targets, the file %1 does not contain a proper CMAKE_COMMAND entry !
de: Kann keine Ziele laden, weil die Datei %1 keinen korrekten CMAKE_COMMAND-Eintrag enthält!
ga: Ní féidir spriocanna a luchtú, níl iontráil CMAKE_COMMAND cheart sa chomhad %1 !
ia: Non pote cargar objectivos, le file %1 non contine un proprie entrata de CMAKE COMMAND!
ko: 대상을 불러올 수 없음. %1 파일에 올바른 CMAKE_COMMAND 항목이 없음!
pt: Não é possível carregar os alvos, o ficheiro %1 não contém uma entrada 'CMAKE_COMMAND' adequada!
tr: Hedefler yüklenemiyor; %1 dosyası düzgün bir CMAKE_COMMAND girdisi içermiyor!
zh_tw: 無法載入目標，檔案 %1 不包含正確的 CMAKE_COMMAND 條目！

source: Could not write CMake File API query files for build directory %1 !
de: Dateibasierte API von CMake: Anfragedateien für den Erstellungsordner %1 können nicht geschrieben werden!
ga: Níorbh fhéidir comhaid iarratais API CMake File a scríobh don eolaire tógála %1 !
ia: Non poteva scriber files de query de CMake File Apiper construer directorio %1!
ko: %1 빌드 디렉터리에 CMake 파일 API 질의 파일을 기록할 수 없음!
pt: Não foi possível escrever os ficheiros de consulta da API de Ficheiros do CMake para o diretório de compilação %1!
tr: %1 yapı dizini için CMake Dosya API Sorgusu dosyaları yazılamadı!
zh_tw: 無法為編譯目錄 %1 寫入 CMake 檔案 API 查詢檔案！

source: Could not run CMake (%2) for build directory %1 !
de: CMake (%2) kann für Erstellungsordner %1 nicht ausgeführt werden!
ga: Níorbh fhéidir CMake (%2) a rith don eolaire tógála %1!
ia: Non poteva executar Cmake (%2) per construer directorio %1!
ko: %1 빌드 디렉터리에서 CMake를 실행할 수 없음(%2)!
pt: Não foi possível executar o CMake (%2) para o diretório de compilação %1!
tr: %1 yapı dizini için CMake (%2) çalıştırılamadı!
zh_tw: 無法為編譯目錄 %1 執行 CMake (%2)！

source: Generating CMake File API reply files for build directory %1 failed (using %2) !
de: Dateibasierte API von CMake: Das Erstellen der Antwortdateien durch CMake für Erstellungsordner %1 ist fehlgeschlagen (verwendet wurde %2)!
ga: Theip ar chomhaid freagartha API CMake File a ghiniúint don eolaire tógála %1 (ag baint úsáide as %2) !
ia: Generar files de responsa de CMake File API per construer directorio %1 falleva (usante %2) !
ko: %1 빌드 디렉터리에서 CMake 파일 API의 응답 파일 생성 실패(%2 사용)!
pt: A criação dos ficheiros de resposta da API de Ficheiros do CMake para o diretório de compilação %1 falhou (utilizando %2)!
tr: %1 yapı dizini için (%2 kullanarak) CMake Dosya API Yanıtı dosyaları üretilemedi!
zh_tw: 為編譯目錄 %1 產生 CMake 檔案 API 回覆檔時失敗了（使用 %2）！

source: Build plugin wants to execute program
de: Das Erstellungsmodul möchte ein Programm ausführen
ga: Tá an breiseán tógála ag iarraidh clár a fhorghníomhú
ia: Plugin de construer vole executar programma
ko: 빌드 플러그인에서 프로그램을 실행하려고 함
pt: O suplemento de compilação pretende executar um programa
tr: Program Yürütme İsteği
zh_tw: 編譯外掛程式希望執行程式

source: The Kate build plugin needs to execute an external command to read the targets from the build tree.<br><br>The full command line is:<br><br><b>%1</b><br><br>Proceed and allow to run this command ?<br><br>The choice can be altered via the config page of the plugin.
de: Das Erstellungsmodul von Kate muss einen externen Befehl ausführen, um die Ziele des Erstellbaums zu lesen.<br><br>Die komplette Befehlszeile ist:<br><br><b>%1</b><br><br>Fortfahren und den Befehl ausführen?<br><br>Die Auswahl kann auf der Konfigurationsseite des Moduls geändert werden.
ga: Caithfidh breiseán tógála Kate ordú seachtrach a fhorghníomhú chun na spriocanna ón gcrann tógála a léamh.<br><br>Seo an líne ordaithe iomlán:<br><br><b>%1</b><br><br>Lean ar aghaidh agus cead a thabhairt don ordú seo a rith?<br><br>Is féidir an rogha a athrú tríd an leathanach cumraíochta den bhreiseán.
ia: Le plugin de construer de Kate necessita executar un commandoexterne per leger le objectivos ex le arbore de construer.<br><br>Le linea complete de commando es:<br><br><b>%1</b><br><br>Tu procede e permitte executar iste commando? <br><br>Le selection pote esser alterate via le pagina de configuration del plugin.
ko: Kate 빌드 플러그인은 빌드 트리에서 빌드 대상을 읽기 위해서 외부 명령을 수행해야 합니다.<br><br>전체 명령행:<br><br><b>%1</b><br><br>이 명령을 실행하시겠습니까?<br><br>플러그인 설정 페이지에서 선택 사항을 나중에 변경할 수 있습니다.
pt: O suplemento de compilação do Kate precisa de executar um comando externo para ler os alvos da árvore de compilação.<br><br>A linha de comando completa é:<br><br><b>%1</b><br><br>Continuar e permitir a execução deste comando?<br><br>A escolha pode ser alterada através da página de configuração do suplemento.
tr: Kate yapı eklentisinin, yapı ağacındaki hedefleri okuması için bir dış programı yürütmesi gerekiyor.<br><br>Tam komut satırı şu:<br><br><b>%1</b><br><br>Sürdürüp bu komutun çalıştırılmasına izin vermek istiyor musunuz?<br><br>Bu seçim, eklentinin yapılandırma sayfasından değiştirilebilir.
zh_tw: Kate 編譯外掛程式需要執行外部命令來從編譯樹讀取目標。<br><br>完整命令列是：<br><br><b>%1</b><br><br>要繼續並允許執行此命令嗎？<br><br>此選項可在外掛程式的設定頁面修改。

# @info
source: <title>Build Finished:</title>%1
de: <title>Das Erstellen ist beendet:</title>%1
ga: <title>Tógáil Críochnaithe:</title>%1
ia: <title>Construction (build) terminate :</title><nl/>%1
ko: <title>빌드 완료됨:</title>%1
pt: <title>Compilação terminada:</title>%1
tr: <title>Yapı bitti:</title><nl/>%1
zh_tw: <title>編譯已完成：</title>%1

source: Build <b>%1: %2</b> completed. %3 error(s), %4 warning(s), %5 note(s)
de: Erstellen von <b>%1: %2</b> abgeschlossen. %3 Fehler, %4 Warnung(en), %5 Hinweis(e)
ga: Tógáil <b>%1: %2</b> críochnaithe. %3 earráid(í), %4 rabhadh(anna), %5 nóta(í)
ia: Construe <b>%1:%2</b> completate. %3 error(es), %4 aviso(s), %5 nota(s)
ko: <b>%1: %2</b> 빌드가 완료되었습니다. 오류 %3개, 경고 %4개, 메모 %5개
pt: Compilação de <b>%1: %2</b> concluída. %3 erro(s), %4 aviso(s), %5 nota(s)
tr: <b>%1: %2</b> yapısı tamamlandı. %3 hata, %4 uyarı, %5 not
zh_tw: 編譯 <b>%1: %2</b> 已完成。%3 個錯誤，%4 個警告，%5 個備註

source: Found one error.
de: Einen Fehler gefunden.
ga: Aimsíodh earráid amháin.
ia: Trovava un error
ko: 오류 %1개를 발견했습니다.
pt: Foi encontrado um erro.
tr: 1 hata bulundu.
zh_tw: 找到 %1 個錯誤。

source: Found one warning.
de: Eine Warnung gefunden.
ga: Aimsíodh rabhadh amháin.
ia: Trovava un aviso
ko: 경고 %1개를 발견했습니다.
pt: Foi encontrado um aviso.
tr: 1 uyarı bulundu.
zh_tw: 找到 %1 個警告。

source: Found one note.
de: Einen Hinweis gefunden.
ga: Aimsíodh nóta amháin.
ia: Trovava un nota.
ko: 메모 %1개를 발견했습니다.
pt: Foi encontrada uma nota.
tr: 1 not bulundu.
zh_tw: 找到 %1 個備註。

source: Build canceled.
ga: Cuireadh an tógáil ar ceal.
ko: 빌드가 취소되었습니다.
pt: Compilação cancelada.
tr: Yapı iptal edildi.
zh_tw: 編譯取消。

source: Build failed.
de: Erstellen fehlgeschlagen.
ga: Theip ar thógáil.
ia: Construction falleva
ko: 빌드가 실패했습니다.
pt: A compilação falhou.
tr: Yapı başarısız oldu.
zh_tw: 編譯失敗。

source: Build completed without problems.
de: Erstellen ohne Probleme abgeschlossen.
ga: D'éirigh leis an tógáil gan fadhb ar bith.
ia: Construe completate sin problemas.
ko: 빌드가 성공적으로 끝났습니다.
pt: Compilação concluída sem problemas.
tr: Yapı sorunsuzca tamamlandı.
zh_tw: 編譯已順利完成。

source: Build <b>%1: %2 canceled</b>. %3 error(s), %4 warning(s), %5 note(s)
de: Erstellen von <b>%1: %2 abgebrochen</b>. %3 Fehler, %4 Warnung(en), %5 Hinweis(e)
ga: Tógáil <b>%1: %2 curtha ar ceal</b>. %3 earráid(í), %4 rabhadh(anna), %5 nóta(í)
ia: Construe <b>%1:%2 cancellate</b>. %3 error(es), %4 aviso(s), %5 nota(s)
ko: <b>%1: %2 빌드가 취소되었습니다</b>. 오류 %3개, 경고 %4개, 메모 %5개
pt: Compilação de <b>%1: %2 cancelada</b>. %3 erro(s), %4 aviso(s), %5 nota(s)
tr: <b>%1: %2</b> yapısı iptal edildi. %3 hata, %4 uyarı, %5 not
zh_tw: 編譯 <b>%1: %2 已取消</b>。 %3 個錯誤，%4 個警告，%5 個備註

# The same word as 'gcc' uses for an error.
source: error
de: Fehler
ga: earráid
pt: erro
tr: hata
zh_tw: 錯誤
