Repository: KDE/kate
Catalog: po/*/katekeyboardmacros.po
Languages: cs, pt_br

source: Could not open file '%1'.
cs: Nelze otevřít soubor '%1'.
pt_br: Não foi possível abrir o arquivo '%1'.

source: Malformed JSON file '%1': %2
cs: Neplatný soubor JSON '%1': %2
pt_br: Arquivo JSON mal formado '%1': %2

source: Could not load '%1': malformed macro; wiping it.
cs: Nelze načíst '%1': špatně vytvořené makro; probíhá jeho odstranění.
pt_br: Não foi possível carregar '%1': macro malformada; a limpar.

source: Keyboard Macros
cs: Klávesová makra
pt_br: Macros de teclado

source: <b>Keyboard Macros:</b> %1
cs: <b>Klávesová makra:</b> %1
pt_br: <b>Macros de teclado:</b> %1

source: Can't save macro during recording. Please end recoding first
cs: Nelze uložit makro během nahrávání. Nejprve ukončete nahrávání
pt_br: Não é possível salvar um macro durante a gravação. Termite a gravação primeiro

source: Recording…
cs: Nahrávání...
pt_br: Gravando…

source: ended
cs: ukončeno
pt_br: terminado

source: canceled
cs: zrušeno
pt_br: cancelado

source: Recording %1
cs: Nahrávání %1
pt_br: Gravando %1

source: Saved '%1'
cs: Uloženo '%1'
pt_br: Salvou '%1'

source: Loaded '%1'
cs: Načteno '%1'
pt_br: Carregou '%1'

source: Wiped '%1'
cs: Smazáno '%1'
pt_br: Limpou '%1'

source: Usage: %1 <name>.
cs: Využití: %1 <name>.
pt_br: Uso: %1 <nome>.

source: No keyboard macro named '%1' found.
cs: Nenašlo se žádné klávesové makro pojmenované '%1'.
pt_br: Não foi encontrada nenhuma macro de teclado com o nome '%1'.

source: Cannot save empty keyboard macro.
cs: Není možné uložit prázdné klávesové makro.
pt_br: Não é possível guardar uma macro de teclado vazia.

source: <qt><p>Usage: <code>kmsave &lt;name&gt;</code></p><p>Save current keyboard macro as <code>&lt;name&gt;</code>.</p>%1</qt>
cs: <qt><p>Použití: <code>kmsave &lt;název&gt;</code></p><p>Uložit aktuální klávesové makro jako <code>&lt;název&gt;</code>.</p>%1</qt>
pt_br: <qt><p>Uso: <code>kmsave &lt;name&gt;</code></p><p>Salva o macro de teclado atual como <code>&lt;name&gt;</code>.</p>%1</qt>

source: <qt><p>Usage: <code>kmload &lt;name&gt;</code></p><p>Load saved keyboard macro <code>&lt;name&gt;</code> as current macro.</p>%1</qt>
cs: <qt><p>Použití: <code>kmload &lt;název&gt;</code></p><p>Nahrajte uložené klávesové makro <code>&lt;název&gt;</code> jako aktuální makro.</p>%1</qt>
pt_br: <qt><p>Uso: <code>kmload &lt;name&gt;</code></p><p>Carrega o macro de teclado salvo <code>&lt;name&gt;</code> como o macro atual.</p>%1</qt>

source: <qt><p>Usage: <code>kmplay &lt;name&gt;</code></p><p>Play saved keyboard macro <code>&lt;name&gt;</code> without loading it.</p>%1</qt>
cs: <qt><p>Použití: <code>kmplay &lt;název&gt;</code></p><p>Přehrát uložené klávesové makro <code>&lt;název&gt;</code> bez jeho načtení.</p>%1</qt>
pt_br: <qt><p>Uso: <code>kmplay &lt;name&gt;</code></p><p>Reproduz o macro de teclado salvo <code>&lt;name&gt;</code> sem carregá-lo.</p>%1</qt>

source: <qt><p>Usage: <code>kmwipe &lt;name&gt;</code></p><p>Wipe saved keyboard macro <code>&lt;name&gt;</code>.</p>%1</qt>
cs: <qt><p>Použití: <code>kmwipe &lt;název&gt;</code></p><p>Smazat uložené klávesové makro <code>&lt;název&gt;</code>.</p>%1</qt>
pt_br: <qt><p>Uso: <code>kmwipe &lt;name&gt;</code></p><p>Limpa o macro de teclado salvo <code>&lt;name&gt;</code>.</p>%1</qt>

source: &Keyboard Macros
cs: &Klávesová makra
pt_br: Macros de &teclado

source: Record and play keyboard macros.
cs: Zaznamenávejte a přehrávejte klávesová makra.
pt_br: Gravar e reproduza macros de teclado.

source: &Record Macro...
cs: Nah&rát makro...
pt_br: &Gravar macro...

source: Start/stop recording a macro (i.e., keyboard action sequence).
cs: Spustit/ukončit nahrávání makra (tj. sekvence akcí klávesnice).
pt_br: Iniciar/parar a gravação de uma macro (ou seja, sequência de ações do teclado).

source: &Cancel Macro Recording
cs: &Zrušit nahrávání makra
pt_br: &Cancelar gravação de macro

source: Cancel ongoing recording (and keep the previous macro as the current one).
cs: Zrušit probíhající nahrávání (a ponechat předchozí makro jako aktuální).
pt_br: Cancele a gravação em andamento (e mantenha a macro anterior como a atual).

source: &Play Macro
cs: &Přehrát makro
pt_br: &Reproduzir macro

source: Play current macro (i.e., execute the last recorded keyboard action sequence).
cs: Přehrát aktuální makro (tj. vykonat poslední zaznamenanou sekvenci akcí klávesnice).
pt_br: Reproduzir a macro atual (ou seja, executar a última sequência de ação do teclado gravada).

source: &Save Current Macro
cs: &Uložit aktuální makro
pt_br: &Salvar macro atual

source: Give a name to the current macro and persistently save it.
cs: Pojmenovat aktuální makro a trvale ho uložit.
pt_br: Dê um nome à macro atual e salve-a persistentemente.

source: &Load Named Macro...
cs: &Načíst pojmenované makro...
pt_br: &Carregar macro nomeada...

source: Load a named macro as the current one.
cs: Načíst pojmenované makro jako aktuální.
pt_br: Carrega uma macro nomeada como a atual.

source: &Play Named Macro...
cs: &Přehrát pojmenované makro...
pt_br: &Reproduzir macro nomeada...

source: Play a named macro without loading it.
cs: Přehrát pojmenované makro bez jeho načtení.
pt_br: Reproduza uma macro nomeada sem carregá-la.

source: &Wipe Named Macro...
cs: &Smazat pojmenované makro...
pt_br: &Apagar macro nomeada...

source: Wipe a named macro.
cs: Smazat pojmenované makro.
pt_br: Limpe uma macro nomeada.

source: End Macro &Recording
cs: U&končit nahrávání makra
pt_br: Finalizar macro e &gravação

source: Load %1
cs: Načíst %1
pt_br: Carregar %1

source: Load the '%1' macro as the current one.
cs: Načíst makro '%1' jako aktuální.
pt_br: Carregue a macro '%1' como a atual.

source: Play %1
cs: Přehrát %1
pt_br: Jogar %1

source: Play the '%1' macro without loading it.
cs: Přehrát makro '%1' bez jeho načtení.
pt_br: Reproduza a macro '%1' sem carregá-la.

source: Wipe %1
cs: Smazat %1
pt_br: Limpar %1

source: Wipe the '%1' macro.
cs: Smazat makro '%1'.
pt_br: Limpe a macro '%1'.

source: Save current macro as?
cs: Chcete aktuální makro uložit pod názvem?
pt_br: Salvar a macro atual como?

source: Wipe the '%1' macro?
cs: Chcete makro '%1' smazat?
pt_br: Limpar a macro '%1'?

source: &Tools
cs: Nás&troje
pt_br: Ferramen&tas
