Repository: KDE/kate
Catalog: po/*/katebuild-plugin.po
Languages: de, ga, ia, ko, pt, tr, zh_tw

# The same word as 'gcc' uses for a warning.
source: warning
de: Warnung
ga: rabhadh
ia: aviso
pt: aviso
tr: uyarı
zh_tw: 警告

# The same words as 'gcc' uses for note or info.
source: note|info
de: Hinweis
ga: nóta|eolas
ia: nota|info
pt: nota|informações
tr: not|bilgi
zh_tw: 備註|資訊

# The same word as 'ld' uses to mark an ...
source: undefined reference
de: Undefinierter Verweis
ga: tagairt gan sainmhíniú
ia: referentia non definite
pt: referência não definida
tr: tanımlanmamış başvuru
zh_tw: 未定義的參照

source: Cannot save build targets in: %1
de: Die Ziele für das Erstellen können nicht in %1 gespeichert werden
ga: Ní féidir spriocanna tógála a shábháil i: %1
ia: Non pote salveguardar objectivos construite in: %1
ko: 빌드 대상을 다음에 저장할 수 없음: %1
pt: Não foi possível guardar os alvos de compilação em: %1
tr: Şuradaki yapı hedefleri kaydedilemiyor: %1
zh_tw: 無法儲存編譯目標於：%1

# T as in Target set
source: <B>T:</B> %1
de: <B>Z:</B> %1
ko: <B>대상:</B> %1
pt: <B>A:</B> %1
tr: <B>Hedef:</B> %1

# Dir as in working Directory
source: <B>Dir:</B> %1
de: <B>Ordner:</B> %1
ko: <B>디렉터리:</B> %1
tr: <B>Dizin:</B> %1
zh_tw: <B>目錄：</B>%1

source: Leave empty to use the directory of the current document. Add search directories by adding paths separated by ';'
de: Wenn Sie dieses Feld leer lassen, wird der Ordner des aktuellen Dokuments verwendet. Fügen Sie weitere Suchordner hinzu, indem Sie Pfade getrennt durch „;“ anfügen.
ga: Fág folamh chun eolaire an doiciméid reatha a úsáid. Cuir eolairí cuardaigh leis trí chosáin scartha le ';' a chur leis.
ia: Lassa vacue pro usar le directorio del documento currente. Adder directorios de cerca per adder percursos separate per ';'
ko: 비워 두면 현재 문서의 디렉터리를 사용합니다. 검색할 디렉터리를 ';' 문자로 구분해서 입력하십시오
pt: Deixe em branco para utilizar a pasta do documento atual. Adicione diretórios de pesquisa acrescentando caminhos separados por ';'
tr: Geçerli dosyanın dizinini kullanmak için boş bırakın. “;” ile ayrılmış yollar ekleyerek arama dizinleri ekleyin
zh_tw: 空白表示使用目前文件的目錄。 透過以 ';' 分隔的路徑新增搜尋目錄

source: Use: "%B" for project base directory "%b" for name of project base directory
de: Verwenden Sie: „%B“ für den Projektbasisordner „%b“ für den Namen des Projektbasisordners
ga: Úsáid: "%B" don eolaire bonn tionscadail "%b" d'ainm an eolaire bonn tionscadail
ia: Usa: "%B" perdirectoriobase de projecto "%b" per nomine de directorio base de projecto
ko: 사용 방법: "%B": 프로젝트 기반 디렉터리 "%b": 프로젝트 기반 디렉터리의 이름
pt: Utilizar: "%B" para o diretório base do projeto "%b" para o nome do diretório base do projeto
tr: Kullanım: proje taban dizini için “%B” proje taban dizininin adı için “%b”
zh_tw: 使用： "%B" 代表專案基底目錄 "%b" 代表專案基底目錄的名稱

source: Use: "%f" for current file "%d" for directory of current file "%n" for current file name without suffix "%B" for current project's base directory "%w" for the working directory of the target
de: Verwenden Sie: „%f“ für die aktuelle Datei „%d“ für den Ordner der aktuellen Datei „%n“ für den aktuellen Dateinamen ohne Erweiterung „%B“ für den aktuellen Projekt-Basisordner „%w“ für den Arbeitsordner des Ziels
ga: Úsáid: "%f" don chomhad reatha "%d" don eolaire den chomhad reatha "%n" don ainm comhaid reatha gan an iarmhír "%B" don bhuneolaire den tionscadal reatha "%w" don eolaire oibre den sprioc
ko: 사용 방법: 현재 파일: "%f" 현재 파일의 디렉터리: "%d" 접두사 없는 현재 파일 이름: "%n" 현재 프로젝트의 기반 디렉터리: "%B" 현재 대상의 작업 디렉터리: "%w"
pt: Utilizar: "%f" para o ficheiro atual "%d" para a pasta do ficheiro atual "%n" para o nome do ficheiro atual sem sufixo "%B" para o diretório base do projeto atual "%w" para o diretório de trabalho do alvo
tr: Kullanım: geçerli dosya için “%f” geçerli dosyanın bulunduğu dizin için “%d” sonek olmadan geçerli dosya adı için “%n” geçerli projenin taban dizini için “%B” hedefin çalışma dizini için “%w”
zh_tw: 使用： "%f" 表示目前的檔案 "%d" 表示目前檔案所在的目錄 "%n" 表示目前的檔名，不含後置字串 "%B" 表示目前專案的基礎目錄 "%w" 表示目標的工作目錄

source: Target Set
de: Zielgruppe
ga: Tacar Sprioc
ia: Insimul de Objectivo
ko: 대상 설정
pt: Conjunto de alvos
tr: Hedef Kümesi
zh_tw: 目標集

source: Projects
de: Projekte
ga: Tionscadail
ia: Projectos
ko: 프로젝트
pt: Projetos
tr: Projeler
zh_tw: 專案

source: Session
de: Sitzung
ga: Seisiún
ko: 세션
pt: Sessão
tr: Oturum
zh_tw: 工作階段

source: Command/Target-set Name
de: Name von Befehl/Zielgruppe
ga: Ainm an Ordaithe/an Tacair Sprioc
ia: Nomine de Commando/Insimul de objectivo
ko: 명령/대상 집합 이름
pt: Comando/Nome do conjunto de alvos
tr: Komut/Hedef Kümesi Adı
zh_tw: 指令/目標集名稱

source: Build Command / Working Directory
de: Erstellungsbefehl / Arbeitsordner
ga: Tóg Ordú / Eolaire Oibre
ia: Commando a contruer/Directorio de travalio
ko: 빌드 명령/작업 디렉터리
pt: Comando de compilação/Diretório de trabalho
tr: Yapı Komutu/Çalışma Dizini
zh_tw: 編譯指令/工作目錄

source: Run Command
de: Befehl ausführen
ga: Rith Ordú
ia: Executa commando
ko: 실행 명령
pt: Executar comando
tr: Komutu Çalıştır
zh_tw: 執行指令

source: Filter targets, use arrow keys to select, Enter to execute
de: Ziele filtern, mit Pfeiltasten auswählen und mit Enter ausführen
ga: Scag spriocanna, bain úsáid as na heochracha saigheada chun a roghnú, agus Iontráil chun é a fhorghníomhú
ia: Filtra objectivos, usa claves de flecha pro seliger, Enter per executar
ko: 대상 필터입니다. 화살표 키로 선택하고 Enter 키로 실행
pt: Filtrar alvos, utilize as teclas de setas para selecionar, Enter para executar
tr: Hedefleri süz, seçmek için ok düğmelerini kullan ve yürütmek için Giriş’e bas
zh_tw: 過濾目標，用方向鍵來選取，Enter 來執行

source: Create new set of targets
de: Neue Zielgruppe erstellen
ga: Cruthaigh sraith spriocanna nua
ia: Crea nove insimul de objectivos
ko: 새 대상 집합 만들기
pt: Criar novo conjunto de alvos
tr: Yeni hedef kümesi oluştur
zh_tw: 建立新的目標集

source: Clone command or target set
de: Befehl oder Zielgruppe klonen
ga: Ordú clónála nó tacar sprice
ia: Clona commando o insimul objectivo
ko: 명령이나 대상 집합 복제
pt: Clonar comando ou conjunto de alvos
tr: Komutu veya Hedef Kümesini Klonla
zh_tw: 重製指令或目標集

source: Delete current target or current set of targets
de: Aktuelles Ziel oder aktuelle Zielgruppe löschen
ga: Scrios an sprioc reatha nó an tacar spriocanna reatha
ia: Dele objectivo currente o insimul currente de objectivos
ko: 현재 대상이나 대상 집합 삭제
pt: Eliminar o alvo atual ou o conjunto de alvos atual
tr: Geçerli hedefi veya geçerli hedef kümelerini sil
zh_tw: 刪除目前的目標或目前的目標集

source: Add new target
de: Neues Ziel hinzufügen
ga: Cuir sprioc nua leis
ia: Adde nove objectivo
ko: 새 대상 추가
pt: Adicionar novo alvo
tr: Yeni hedef ekle
zh_tw: 新增目標

source: Build selected target
de: Ausgewähltes Ziel erstellen
ga: Tóg sprioc roghnaithe
ia: Construe objectivo seligite
ko: 선택한 대상 빌드
pt: Compilar alvo selecionado
tr: Seçili hedefi yap
zh_tw: 編譯選取的目標

source: Build and run selected target
de: Ausgewähltes Ziel erstellen und ausführen
ga: Tóg agus rith an sprioc roghnaithe
ia: Construe e exeque objectivo seligite
ko: 선택한 대상 빌드 후 실행
pt: Compilar e executar alvo selecionado
tr: Seçili hedefi yap ve çalıştır
zh_tw: 編譯並執行選取的目標

source: Move selected target up
de: Ausgewähltes Ziel nach oben verschieben
ga: Bog an sprioc roghnaithe suas
ia: Move objectivo seligite in alto
ko: 선택한 대상 위로 이동
pt: Mover o alvo selecionado para cima
tr: Seçili hedefi yukarı taşı
zh_tw: 將所選目標上移

source: Move selected target down
de: Ausgewähltes Ziel nach unten verschieben
ga: Bog an sprioc roghnaithe síos
ia: Move objectivo seligite a basso
ko: 선택한 대상 아래로 이동
pt: Descer o alvo seleccionado
tr: Seçili hedefi aşağı taşı
zh_tw: 將所選目標下移

source: Copy
de: Kopieren
ga: Cóipeáil
ia: Copia
ko: 복사
pt: Copiar
tr: Kopyala
zh_tw: 複製

source: Cut
de: Ausschneiden
ga: Gearr
ia: Talia
ko: 잘라내기
pt: Cortar
tr: Kes
zh_tw: 剪下

source: Paste after
de: Dahinter einfügen
ga: Greamaigh ina dhiaidh
ia: Colla post
ko: 뒤에 붙여넣기
pt: Colar depois
tr: Sonrasında Yapıştır
zh_tw: 在後方貼上

# Name/Label for a compilation or build command
source: Build Command
de: Befehl zum Erstellen
ga: Tóg Ordú
ia: Construe commando
ko: 빌드 명령
pt: Comando de compilação
tr: Yapı komutu
zh_tw: 編譯指令

# Name/Label for a command to configure a build
source: Configure
de: Einstellungen
ga: Cumraigh
ia: Configura
ko: 설정
pt: Configurar
tr: Yapılandır
zh_tw: 配置

source: &Build
de: &Erstellen
ga: &Tóg
ia: &Construe
ko: 빌드(&B)
pt: &Compilar
tr: &Yapı
zh_tw: 編譯(&B)

source: Build Plugin Toolbar
ga: Breiseán TógálaBarra Uirlisí Breiseáin Tógála
ko: 빌드 플러그인 도구 모음
pt: Barra de ferramentas do suplemento de compilação
tr: Yapı Eklentisi Araç Çubuğu
zh_tw: 編譯外掛程式工具列

source: Insert path
de: Pfad einfügen
ga: Cuir cosán isteach
ia: Inserta percurso
ko: 삽입 경로
pt: Inserir caminho
tr: Yol ekle
zh_tw: 插入路徑

source: Select directory to insert
de: Ordner zum Einfügen wählen
ga: Roghnaigh eolaire le cur isteach
ia: Selige directorio de insertar
ko: 삽입할 디렉터리 선택
pt: Selecionar pasta a inserir
tr: Eklenecek dizini seç
zh_tw: 選擇要插入的目錄
