Repository: KDE/kate
Catalog: po/*/kate-replicode-plugin.po
Languages: ar

source: Run
ar: شغّل

source: Run time (milliseconds):
ar: زمن التّشغيل (بالملّي ثانية):

source: Probe level:
ar: مستوى التحقيق:

source: User operations layout module:
ar: وحدة تخطيط عمليّات المستخدم:

source: User classes file:
ar: ملفّ أصناف المستخدم:

source: Base period:
ar: فترة الأساس:

source: Reduction core count:
ar: عدد نوى التخفيض:

source: Time core count:
ar: عدد نوى الوقت:

source: System
ar: النّظام

source: Model inertia success rate threshold:
ar: عتبة معدل نجاح القصور الذاتي النموذج:

source: Model inertia count threshold:
ar: عتبة العد الجمود النموذجية:

source: Targeted pattern extractor delta success rate threshold:
ar: عتبة معدل نجاح دلتا المستهدف المستهدف:

source: Minimum simulation time horizon:
ar: أفق وقت المحاكاة الأدنى:

source: Maximum simulation time horizon:
ar: أقصى أفق وقت المحاكاة:

source: Simulation time horizon:
ar: أفق وقت المحاكاة:

source: Targeted pattern extractor time horizon:
ar: أفق وقت مستخرج النمط المستهدف:

source: Perf sampling period:
ar: فترة أخذ عينات بيرف:

source: Float tolerance:
ar: تسامح تعويم:

source: Timer tolerance:
ar: تحمّل المؤقّت:

source: Primary time horizon:
ar: أفق الوقت الأساسي:

source: Secondary time horizon:
ar: أفق الوقت الثانوي:

source: Notification marker resilience:
ar: مرونة علامة الإشعار:

source: Goal prediction success resilience:
ar: مرونة نجاح التنبؤ بالهدف:

source: Debug
ar: نقّح

source: Debug:
ar: نقّح:

source: Debug windows:
ar: نوافذ التّنقيح:

source: Traces:
ar: الآثار:

source: Composite inputs
ar: المدخلات المركبة

source: Composite outputs
ar: المخرجات المركبة

source: Model inputs
ar: مدخلات النموذج

source: Model outputs
ar: مخرجات النموذج

source: Prediction monitoring
ar: مراقبة التنبؤ

source: Goal monitoring
ar: مراقبة الأهداف

source: Model revision
ar: مراجعة النموذج

source: Model/composite injections
ar: النموذج/الحقن المركبة

source: Decompile objects:
ar: كائنات فكية:

source: Decompile to file:
ar: فك الارتباط بالملف:

source: Ignore named objects:
ar: تجاهل الأشياء المسماة:

source: Dump objects to file:
ar: تفريغ الكائنات للملف:

source: Test objects:
ar: اختبار الكائنات:

source: Decompile models:
ar: نماذج فك:

source: Ignore named models:
ar: تجاهل النماذج المسماة:

source: Dump models to file:
ar: تفريغ النماذج للملف:

source: Test models:
ar: نماذج الاختبار:

source: Path to replicode executor:
ar: مسار تنفيذيّ ريبلكود:

source: Replicode
ar: ريبلكود

source: Replicode configuration
ar: ضبط ريبلكود

source: Run replicode
ar: شغّل ريبلكود

source: Stop replicode
ar: أوقف ريبلكود

source: Replicode Config
ar: ضبط ريبلكود

# shortcut for action
source: Run (%1)
ar: شغّل (%1)

# shortcut for action
source: Stop (%1)
ar: أوقف (%1)

# @title:window
source: Active Document Not Found
ar: لم يوجد مستند نشط

source: Could not find an active document to run.
ar: تعذّر إيجاد مستند نشط لتشغيله.

# @title:window
source: Empty Document
ar: مستند فارغ

source: Cannot execute an empty document.
ar: لا يمكن تنفيذ مستند فارغ.

# @title:window
source: File Not Found
ar: لم يوجد الملفّ

source: Unable to open source file for reading.
ar: تعذّر فتح الملفّ المصدر للقراءة.

# @title:window
source: Replicode Executable Not Found
ar: لم يوجد تنفيذيّ ريبلكود

source: Unable to find replicode executor. Please go to settings and set the path to the Replicode executable.
ar: تعذّر إيجاد تنفيذيّ ريبلكود. فضلًا انتقل إلى الإعدادات واضبط مسار تنفيذيّ ريبلكود.

# @title:window
source: User Operator Library Not Found
ar: لم يعثر على مكتبة مشغل المستخدم

source: Unable to find user operator library. Please go to settings and set the path to the library.
ar: تعذر العثور على مكتبة مشغل المستخدم. يرجى الانتقال إلى الإعدادات وتعيين المسار إلى المكتبة.

source: Replicode execution failed: %1
ar: فشل تنفيذ ريبلكود: %1

source: Replicode execution finished.
ar: انتهى تنفيذ ريبلكود.
