Repository: KDE/kate
Catalog: po/*/katecompilerexplorer.po
Languages: ar, bg, fi, gl, sv, zh_tw

source: Scroll to source
ar: مرّر نحوه المصدر
bg: Превъртане до изходния код
fi: Vieritä lähteeseen
gl: Desprazarse á orixe
sv: Rulla till källkod
zh_tw: 捲動至來源

source: Jump to label
ar: اقفز إلى اللصاقة
bg: Отиване до етикет
fi: Hyppää paikkamerkkiin
gl: Saltar á etiqueta
sv: Gå till beteckning
zh_tw: 跳至旗標

source: Copy
ar: انسخ
bg: Копиране
fi: Kopioi
gl: Copiar
sv: Kopiera
zh_tw: 複製

source: Select All
ar: حدّد الكلّ
bg: Избиране на всичко
fi: Valitse kaikki
gl: Seleccionalo todo
sv: Markera alla
zh_tw: 全部選取

source: Compiler Explorer
ar: مستعرض المُصرّف
bg: Преглед на компилатор
fi: Kääntäjäselain
gl: Explorador do compilador
zh_tw: 編譯器探索工具

source: &Open Current File in Compiler Explorer
ar: ا&فتح الملف الحالي في مستكشف المُصرّف
bg: &Отваряне на текущия файл в Compiler Explorer
fi: A&vaa nykyinen tiedosto CompilerExploreriin
gl: Abrir &o ficheiro actual no explorador do compilador
sv: &Öppna nuvarande fil i Compiler Explorer
zh_tw: 用編譯器探索工具開啟目前檔案(&O)

source: No file open
ar: لا يوجد ملف لفتحه
bg: Няма отворен файл
fi: Ei avoimia tiedostoja
gl: Non hai ningún ficheiro aberto
sv: Ingen fil att öppna
zh_tw: 沒有開啟的檔案

# error category title
source: CompilerExplorer
ar: مستعرض المُصرّف
gl: Explorador do compilador

source: Do you really want to close %1?
ar: هل تريد حقًا إغلاق %1؟
bg: Наистина ли искате да затворите %1?
fi: Haluatko varmasti sulkea tiedoston %1?
gl: Seguro que quere pechar %1?
sv: Vill du verkligen stänga %1?
zh_tw: 您確定要關閉 %1 嗎？

# @info:tooltip Languages like C, C++, Rust
source: Languages
ar: اللغات
bg: Езици
fi: Kielet
gl: Linguaxes
sv: Språk
zh_tw: 語言

# @info:tooltip Compilers like GCC, Clang
source: Compilers
ar: المصرفات
bg: Компилатори
fi: Kääntäjät
gl: Compiladores
sv: Kompilatorer
zh_tw: 編譯器

# @info:placeholder
source: Compiler options…
ar: خيارات المُصرّف…
bg: Настройки на компилатор…
fi: Kääntäjävalinnat…
gl: Opcións de compilación…
sv: Kompilatorväljare…
zh_tw: 編譯器選項

source: Compile
ar: صرّف
bg: Компилиране
fi: Käännä
gl: Compilar
sv: Kompilera
zh_tw: 編譯

source: Options
ar: خيارات
bg: Настройки
fi: Asetukset
gl: Opcións
sv: Alternativ
zh_tw: 選項

source: Demangle Identifiers
ar: فك رموز المعرفات
bg: Demangle идентификатори
fi: Kumoa tunnisteiden sekoittaminen
gl: Desmantelar os identificadores
sv: Gör identifierare läsbara
zh_tw: 顯示未被改變過的識別子

source: Filter Library Functions
ar: رشّح وظائف مكتبة
bg: Филтриране на библиотечните функции
fi: Suodatinkirjaston funktiot
gl: Filtrar as funcións de biblioteca
sv: Filtrera biblioteksfunktioner
zh_tw: 過濾函式庫函數

source: Filter Unused Labels
ar: رشّح اللصائق غير المستخدمة
bg: Филтриране на неизползваните етикети
fi: Suodata käyttämättömät paikkamerkit
gl: Filtrar as etiquetas non usadas
sv: Filtrera oanvända beteckningar
zh_tw: 過濾未使用的旗標

source: Filter Comments
ar: رشح التعليقات
bg: Филтриране на коментарите
fi: Suodata kommentit
gl: Filtrar os comentarios
sv: Filtrera kommentarer
zh_tw: 過濾註解

source: Intel Syntax
ar: بناء جملة إنتل
bg: Синтаксис на Intel
fi: Intel-syntaksi
gl: Sintaxe de Intel
zh_tw: Intel 語法

source: Change URL…
ar: غيّر المسار…
bg: Промяна на URL…
fi: Muuta verkko-osoitetta…
gl: Cambiar o URL…
sv: Ändra webbadress…
zh_tw: 變更 URL…

source: Enter URL
ar: أدخل مسار
bg: Въведете адрес
fi: Syötä verkko-osoite
gl: Insira un URL
sv: Skriv in webbadress
zh_tw: 輸入 URL

source: Enter URL for the CompilerExplorer instance, e.g. “http://localhost:10240”
ar: أدخل عنوان لمستعرض المُصرّف. على سبيل المثال، “http://localhost:10240”
bg: Въведете URL работна сесия на CompilerExplorer, напр. “http://localhost:10240”
fi: Syötä CompilerExplorer-ilmentymän verkko-osoite, esim. ”http://localhost:10240”
gl: Insira o URL da instancia do explorador do compilador, p. ex. «http://localhost:10240».
sv: Ange webbadress till instansen av CompilerExplorer, t.ex. "http://localhost:10240"
zh_tw: 輸入 CompilerExplorer 實體的網址，例如 http://localhost:10240

source: Compiler returned: %1
ar: أرجع المُصرّف: %1
bg: Компилаторът върна: %1
fi: Kääntäjä palautti: %1
gl: O compilador devolveu: %1
sv: Kompilatorn returnerade: %1
zh_tw: 編譯器回傳：%1

source: Reveal linked code
ar: اكشف الرمز المرتبط
bg: Разкриване на свързания код
fi: Paljasta linkitetty koodi
gl: Revelar o código ligado
sv: Avslöja länkad kod
zh_tw: 顯示已連結的程式碼

source: CompilerExplorer
ar: مستعرض المُصرّف
gl: Explorador do compilador

source: '%1' compiler flags were found. Output may not be useful.
ar: عثر على علامات المُصرّف '%1'. قد لا يكون الناتج مفيدًا.
bg: Намерени са флагове на компилатор "%1". Изходният резултат може да не е полезен.
fi: Löytyi käännösliput ”%1”. Tuloste ei ehkä ole hyödyllinen.
gl: Atopáronse as marcas de compilador «%1». Pode que a saída non sexa útil.
sv: %1 kompilatorflaggor hittades. Utdata kanske inte är användbar.
zh_tw: 找到了編譯旗標「%1」。輸出可能不是很有用。
