Repository: KDE/kate
Catalog: po/*/kate.po
Languages: ga

# NAME OF TRANSLATORS
source: Your names
ga: Séamus Ó Ciardhuáin,Kevin Scannell

# EMAIL OF TRANSLATORS
source: Your emails
ga: seoc@iolfree.ie,kscanne@gmail.com

source: Kate - Advanced Text Editor
ga: Kate - Ard-eagarthóir

source: (c) 2000-2024 The Kate Authors
ga: (c) 2000-2024 Údair Kate

source: Start Kate with a given session.
ga: Tosaigh Kate le seisiún ar leith.

source: session
ga: seisiún

source: Start Kate with a new anonymous session, implies '-n'.
ga: Tosaigh Kate le seisiún nua gan ainm, tugann sé '-n' le fios.

source: Force start of a new kate instance (is ignored if start is used and another kate instance already has the given session opened), forced if no parameters and no URLs are given at all.
ga: Tús fórsaithe d'eiseamal nua kate (déantar neamhaird de má úsáidtear tús agus má tá an seisiún tugtha oscailte ag eiseamal eile kate cheana féin), éigeantach mura dtugtar aon pharaiméadair ná aon URLanna ar chor ar bith.

source: If using an already running kate instance, block until it exits, if URLs given to open.
ga: Más rud é go bhfuil cás Kate á rith cheana féin in úsáid, blocáil é go dtí go scoireann sé, má thugtar URLanna le hoscailt.

source: Only try to reuse kate instance with this pid (is ignored if start is used and another kate instance already has the given session opened).
ga: Déan iarracht ach sampla Kate a athúsáid leis an pid seo (ní thugtar aird air má úsáidtear tús agus má tá an seisiún tugtha oscailte ag sampla Kate eile cheana féin).

source: Set encoding for the file to open.
ga: Socraigh ionchódú don chomhad atá le hoscailt.

source: encoding
ga: ionchódú

source: Navigate to this line.
ga: Téigh go dtí an líne seo.

source: line
ga: líne

source: Navigate to this column.
ga: Téigh go dtí an colún seo.

source: column
ga: colún

source: Read the contents of stdin.
ga: Léigh ábhar stdin.

source: The files/URLs opened by the application will be deleted after use
ga: Scriosfar na comhaid/URLanna a osclaíonn an feidhmchlár tar éis úsáide

source: Documents to open.
ga: Doiciméid le hoscailt.

source: [urls...]
ga: [URLanna...]

source: KWrite - Text Editor
ga: KWrite - Eagarthóir Téacs

source: Open File
ga: Oscail Comhad

source: Copy Location
ga: Cóipeáil Suíomh

source: Renamed %1 => %2
ga: Athainmníodh %1 => %2

source: Invalid hash
ga: Hais neamhbhailí

source: %1 doesn't exist in a git repo.
ga: Níl %1 ann i stór git.

# @title:tab
source: Commit %1
ga: Tiomnaigh %1

source: &File
ga: &Comhad

source: File Act&ions
ga: Gníomhartha Comhaíid

source: &Edit
ga: &Eagar

source: Sele&ction
ga: Ro&ghnú

source: &Go
ga: &Téigh

source: &View
ga: &Amharc

source: Split View
ga: Amharc Roinnte

source: &Tools
ga: &Uirlisí

source: Diagnostics View
ga: Radharc Diagnóisic

source: &Settings
ga: &Socruithe

source: &Help
ga: Cab&hair

source: Main Toolbar
ga: Príomhbharra Uirlisí

source: Hamburger Menu Toolbar
ga: Barra Uirlisí Roghchláir Hamburger

source: &Status Bar Items
ga: Míreanna Barra Stádais

# @info
source: Error in regular expression: %1 offset %2: %3
ga: Earráid sa ghnáthléiriú: %1 fritháireamh %2: %3

source: All
ga: Gach

source: Diagnostics limit reached, ignoring further diagnostics. The limit can be configured in settings.
ga: Teorainn diagnóisice sroichte, ag déanamh neamhaird ar dhiagnóisic bhreise. Is féidir an teorainn a chumrú sna socruithe.

# @action:inmenu Diagnostics View actions menu
source: Diagnostics View
ga: Radharc Diagnóisic

source: Quick Fix
ga: Réiteach Tapa

source: Next Item
ga: An Chéad Mhír Eile

source: Previous Item
ga: Mír Roimhe Seo

source: Clear Diagnostics Filter
ga: Glan an Scagaire Diagnóisic

source: Show Hover Info
ga: Taispeáin Eolas Luiche

source: Diagnostics
ga: Diagnóisic

source: Errors
ga: Earráidí

source: Warnings
ga: Rabhaidh

source: Filter…
ga: Scagaire…

# @info:tooltip
source: Clear diagnostics
ga: Diagnóisic shoiléir

source: Error
ga: Earráid

source: Warning
ga: Rabhadh

source: Information
ga: Eolas

# @info
source: %1 [suppressed: %2]
ga: %1 [coiscthe: %2]

source: Expand All
ga: Leathnaigh Uile

source: Collapse All
ga: Laghdaigh Gach Rud

source: Copy to Clipboard
ga: Cóipeáil chuig an nGearrthaisce

source: Remove Global Suppression
ga: Bain Cosc Domhanda

source: Add Global Suppression
ga: Cuir Cosc Domhanda leis

source: Remove Local Suppression
ga: Bain Cosc Áitiúil

source: Add Local Suppression
ga: Cuir Cosc Áitiúil leis

source: Disable Suppression
ga: Díchumasaigh Cosc

source: Enable Suppression
ga: Cumasaigh Cosc

source: Change Style
ga: Athraigh Stíl

source: Side By Side
ga: Taobh le Taobh

source: Unified
ga: Aontaithe

source: Raw
ga: Amh

source: Edit Line
ga: Líne a Chur in Eagar

source: Stage Line
ga: Líne an Stáitse

source: Stage Hunk
ga: Hunk Céime

source: Discard Line
ga: Líne Scriosta

source: Discard Hunk
ga: Scrios an Hunk

source: Unstage Line
ga: Líne Gan Stádas

source: Unstage Hunk
ga: Hunk Gan Stádas

source: <b>git</b> not found. Git is needed to diff the documents. If git is already installed, make sure it is your PATH variable. See https://git-scm.com/downloads
ga: Níor aimsíodh <b>git</b>. Tá Git ag teastáil chun na doiciméid a dhifreáil. Má tá git suiteáilte cheana féin, déan cinnte gurb é d'athróg PATH é. Féach https://git-scm.com/downloads

source: Diff
ga: Difríocht

source: Diff %1
ga: Difríocht %1

source: Diff %1..%2
ga: Difríocht %1..%2

source: Diff %1 .. %2
ga: Difríocht %1 .. %2

source: Show/Hide Commit Info
ga: Taispeáin/Folaigh Eolas Tiomnaithe

source: Jump to Next File
ga: Léim go dtí an chéad chomhad eile

source: Jump to Previous File
ga: Léim go dtí an Comhad Roimhe Seo

source: Jump to Next Hunk
ga: Léim go dtí an chéad cheann eile

source: Jump to Previous Hunk
ga: Léim go dtí an Hunk Roimhe Seo

# Tooltip for a button, clicking the button reloads the diff
source: Reload Diff
ga: Athlódáil Difríocht

# Tooltip for a button
source: Show diff with full context, not just the changed lines
ga: Taispeáin an difríocht leis an gcomhthéacs iomlán, ní hamháin na línte athraithe

source: New file %1
ga: Comhad nua %1

source: Deleted file %1
ga: Scriosadh an comhad %1

source: No differences found
ga: Níor aimsíodh aon difríochtaí

# error message
source: Invalid date: %1
ga: Dáta neamhbhailí: %1

# Help text
source: Filter the log.<ul><li>Use <code>"a:"</code> prefix to filter by author name. For e.g., <b>a:john doe</b></li><li>Use <code>"!a:"</code> prefix to exclude an author. For e.g., <b>!a:john doe</b></li><li>Use <code>"since:"</code> prefix to show commits after the given date. The author date of each commit will be checked. The date format is yyyy-MM-dd For e.g., <b>since:2025-04-17</b></li><li>Use <code>"until:"</code> prefix to show commits before the given date. The author date of each commit will be checked. The date format is yyyy-MM-dd For e.g., <b>until:2025-04-17</b></li><li>To filter messages, just type the search term. If multiple search terms are given then messages matching all the search terms will be shown.</li></ul>To trigger the filter, press the <b>Enter</b> key.
ga: Scag an log.<ul><li>Úsáid réimír <code>"a:"</code> chun scagadh de réir ainm an údair. Mar shampla, <b>a:john doe</b></li><li>Úsáid réimír <code>"!a:"</code> chun údar a eisiamh. Mar shampla, <b>!a:john doe</b></li><li>Úsáid réimír <code>"since:"</code> chun tiomantais tar éis an dáta tugtha a thaispeáint. Déanfar dáta údair gach tiomantais a sheiceáil. Is é an fhormáid dáta yyyy-MM-dd. Mar shampla, <b>since:2025-04-17</b></li><li>Úsáid réimír <code>"until:"</code> chun tiomantais roimh an dáta tugtha a thaispeáint. Déanfar dáta údair gach tiomantais a sheiceáil. Is é an fhormáid dáta bbbb-MM-dd Mar shampla, <b>go dtí:2025-04-17</b></li><li>Chun teachtaireachtaí a scagadh, níl le déanamh ach an téarma cuardaigh a chlóscríobh. Má thugtar téarmaí cuardaigh iolracha, taispeánfar teachtaireachtaí a mheaitseálann na téarmaí cuardaigh go léir.</li></ul>Chun an scagaire a ghníomhachtú, brúigh an eochair <b>Iontráil</b>.

source: Failed to get file history: git executable not found in PATH
ga: Theip ar stair an chomhaid a fháil: ní bhfuarthas an comhad inrite git i PATH

source: Failed to get file history: %1
ga: Theip ar stair an chomhaid a fháil: %1

# @menu:action
source: Copy Commit Hash
ga: Cóipeáil an Hais Tiomnaithe

# @menu:action
source: Show Full Commit
ga: Taispeáin an Tiomantas Iomlán

# @title:tab
source: File History - %1
ga: Stair Chomhaid - %1

source: Running this editor with sudo can cause bugs and expose you to security vulnerabilities. Instead use this editor normally and you will be prompted for elevated privileges when saving documents if needed.
ga: Is féidir le rith an eagarthóra seo le sudo fabhtanna a chruthú agus tú a nochtadh do leochaileachtaí slándála. Ina áit sin, bain úsáid as an eagarthóir seo de ghnáth agus iarrfar ort ceadanna ardaithe a thabhairt agus doiciméid á sábháil agat más gá.

source: Running this editor with kdesu can cause bugs and expose you to security vulnerabilities. Instead use this editor normally and you will be prompted for elevated privileges when saving documents if needed.
ga: Is féidir le rith an eagarthóra seo le kdesu fabhtanna a chruthú agus tú a nochtadh do leochaileachtaí slándála. Ina áit sin, bain úsáid as an eagarthóir seo de ghnáth agus iarrfar ort ceadanna ardaithe a thabhairt agus doiciméid á sábháil agat más gá.

source: Maintainer
ga: Cothaitheoir

source: Core Developer
ga: Bunfhorbróir

source: Developer
ga: Forbróir

source: The cool buffersystem
ga: An córas maoláin thar barr

source: The Editing Commands
ga: Na hOrduithe Eagarthóireachta

source: Testing, ...
ga: Tástáil, ...

source: Former Core Developer
ga: Iar-bhunfhorbhróir

source: KWrite Author
ga: Údar KWrite

source: KWrite port to KParts
ga: Leagan KWrite le haghaidh KParts

source: KWrite Undo History, Kspell integration
ga: Stair Cealaithe KWrite, Comhtháthú Kspell

source: KWrite XML Syntax highlighting support
ga: Aibhsiú Comhréire XML i KWrite

source: Patches and more
ga: Paistí agus tuilleadh

source: Python Plugin Developer
ga: Forbróir Breiseán Python

source: Gerald Senarclens de Grancy
ga: Gearóid Seanclens de Grancy

source: QA and Scripting
ga: QA agus Scriptiú

source: Designer of Kate's mascot 'Kate the Cyber Woodpecker'
ga: Dearthóir mascot Kate 'Kate the Cyber ​​Woodpecker'

source: Highlighting for RPM Spec-Files, Perl, Diff and more
ga: Aibhsiú le haghaidh comhad RPM, Perl, Diff, agus cinn eile

source: Highlighting for VHDL
ga: Aibhsiú VHDL

source: Highlighting for SQL
ga: Aibhsiú SQL

source: Highlighting for Ferite
ga: Aibhsiú Ferite

source: Highlighting for ILERPG
ga: Aibhsiú ILERPG

source: Highlighting for LaTeX
ga: Aibhsiú LaTeX

source: Highlighting for Makefiles, Python
ga: Aibhsiú Makefile, Python

source: Highlighting for Python
ga: Aibhsiú Python

source: Highlighting for Scheme
ga: Aibhsiú Scheme

source: PHP Keyword/Datatype list
ga: Liosta lorgfhocal/cineálacha sonraí le haghaidh PHP

source: Very nice help
ga: Cabhair an-deas

source: All people who have contributed and I have forgotten to mention
ga: Na rannpháirtithe uile a rinne mé dearmaid glan iad a lua

source: Folders can only be opened when the projects plugin is enabled
ga: Ní féidir fillteáin a oscailt ach amháin nuair a bhíonn an breiseán tionscadal cumasaithe

source: The file '%1' could not be opened: it is not a normal file, it is a folder.
ga: Níorbh fhéidir comhad '%1' a oscailt; ní gnáthchomhad é, is fillteán é.

source: Configure
ga: Cumraigh

source: Behavior
ga: Oibriú

source: Behavior Options
ga: Roghanna Iompraíochta

source: PATH
ga: COSÁN

source: List of %1 separated directories where Kate will look for programs to run. This list will be prepended to your PATH environment variable. E.g '/home/USER/myapps/bin/:/home/USER/.local/bin'
ga: Liosta de %1 chomhadlann scartha inar lorgóidh Kate cláir le rith. Cuirfear an liosta seo le do athróg timpeallachta PATH. M.sh. '/home/USER/myapps/bin/:/home/USER/.local/bin'

source: &Behavior
ga: Oi&briú

source: Open each document in its own window
ga: Oscail gach doiciméad ina fhuinneog féin

source: If enabled, each document will be opened in its own window. If not enabled, each document will be opened in a new tab in the current window.
ga: Má tá sé cumasaithe, osclófar gach doiciméad ina fhuinneog féin. Mura bhfuil sé cumasaithe, osclófar gach doiciméad i gcluaisín nua sa fhuinneog reatha.

source: &Switch to output view upon message type:
ga: &Athraigh go dtí an radharc aschuir nuair a dhéantar an teachtaireacht a chineáláil:

source: Never
ga: NeverChoíche

source: Info
ga: Eolas

source: Log
ga: Logáil

source: &Limit output view history:
ga: &Teorainn a chur le stair radhairc aschuir:

source: Unlimited
ga: Gan teorainn

source: Use a separate &dialog for handling externally modified files
ga: Úsáid dialóg &ar leith chun comhaid atá modhnaithe go seachtrach a láimhseáil

source: If enabled, a modal dialog will be used to show all of the modified files. If not enabled, you will be individually asked what to do for each modified file only when that file's view receives focus.
ga: Má tá sé cumasaithe, úsáidfear dialóg mhódúil chun na comhaid uile atá modhnaithe a thaispeáint. Mura bhfuil sé cumasaithe, iarrfar ort ina n-aonar cad atá le déanamh do gach comhad modhnaithe ach amháin nuair a bheidh fócas ar radharc an chomhaid sin.

source: Output timestamps with date
ga: Aschur stampaí ama le dáta

source: When enabled, the output line timestamp headers will be prefixed with date.
ga: Nuair a bheidh sé cumasaithe, cuirfear dáta roimh cheanntásca stampa ama na líne aschuir.

source: &Sidebars
ga: &Barraí Taobh

source: Sync section size with tab positions
ga: Sioncrónaigh méid na rannóige le suíomhanna na gcluaisíní

source: When enabled the section size will be determined by the position of the tabs. This option does not affect the bottom sidebar.
ga: Nuair a bheidh sé cumasaithe, cinnfidh suíomh na gcluaisíní méid na coda. Ní dhéanann an rogha seo difear don bharra taoibh bun.

source: Show text for left and right sidebar buttons
ga: Taispeáin téacs do na cnaipí taobhchláir chlé agus dheis

source: Icon size for left and right sidebar buttons:
ga: Méid deilbhín do chnaipí taobhchláir chlé agus dheis:

source: &Tabs
ga: &Cluaisíní

source: &Limit number of tabs:
ga: &Teorainn a chur ar líon na gcluaisíní:

source: A high limit can increase the window size, please enable 'Allow tab scrolling' to prevent it. Unlimited tabs are always scrollable.
ga: Féadann teorainn ard méid na fuinneoige a mhéadú, cumasaigh 'Ceadaigh scrollú cluaisíní' le cosc ​​a chur air. Is féidir cluaisíní gan teorainn a scrollú i gcónaí.

source: &Auto hide tabs
ga: &Folaigh cluaisíní go huathoibríoch

source: When checked tabs will be hidden if only one document is open.
ga: Nuair a bheidh sé seo seiceáilte, beidh na cluaisíní i bhfolach mura bhfuil ach doiciméad amháin oscailte.

source: &Show close button
ga: &Taispeáin an cnaipe dúnta

source: When checked each tab will display a close button.
ga: Nuair a bheidh sé seiceáilte taispeánfar cnaipe dúnta i ngach cluaisín.

source: &Expand tabs
ga: &Leathnaigh na cluaisíní

source: When checked tabs take as much size as possible.
ga: Nuair a bhíonn siad seiceáilte, glacann na cluaisíní an oiread méide agus is féidir.

source: &Double click opens a new document
ga: Osclaíonn cliceáil faoi dhó doiciméad nua

source: When checked double click opens a new document.
ga: Nuair a dhéantar tic a chur leis, osclaítear doiciméad nua le cliceáil faoi dhó.

source: &Middle click closes a document
ga: Dúnann cliceáil lár doiciméad

source: When checked middle click closes a document.
ga: Nuair a bhíonn sé seiceáilte, dúnann cliceáil lár doiciméad.

source: Allow tab scrolling
ga: Ceadaigh scrollú cluaisíní

source: When checked this will allow scrolling in tab bar when number of tabs is large.
ga: Nuair a bheidh sé seo roghnaithe, ceadóidh sé scrollú sa bharra cluaisíní nuair a bhíonn líon mór cluaisíní ann.

source: Elide tab text
ga: Téacs cluaisín Elide

source: When checked tab text might be elided if it is too long.
ga: Nuair a bhíonn sé seo seiceáilte, d’fhéadfadh téacs an chluaisín a bheith ar lár má tá sé rófhada.

source: Open new tabs to the right of the current tab
ga: Oscail cluaisíní nua ar dheis an chluaisín reatha

source: If unchecked the new tab will open at the end.
ga: Mura bhfuil tic curtha ann, osclófar an cluaisín nua ag an deireadh.

source: Allow cycling through tabs
ga: Ceadaigh rothlú trí chluaisíní

# If 'Allow cycling through tabs' is disabled.
source: If unchecked, the action '%1'/'%2' will not go to first/last tab after reaching the end.
ga: Mura bhfuil an rogha seo roghnaithe, ní rachaidh an gníomh '%1'/'%2' go dtí an chéad chluaisín/an cluaisín deireanach tar éis an deireadh a bhaint amach.

source: &Mouse
ga: &Luch

source: &Backward button pressed:
ga: Cnaipe &Ar Ais brúite:

source: Previous tab
ga: Táb roimhe seo

source: History back
ga: Stair siar

source: &Forward button pressed:
ga: Cnaipe &Ar Aghaidh brúite:

source: Next tab
ga: An chéad chluaisín eile

source: History forward
ga: Stair ar aghaidh

source: Diff Style:
ga: Stíl Difríochta:

source: Navigation Bar
ga: Barra Nascleanúna

source: Show current symbol in navigation bar
ga: Taispeáin an tsiombail reatha sa bharra nascleanúna

source: Diagnostics limit:
ga: Teorainn diagnóisice:

source: Max number of diagnostics allowed in the Diagnostics toolview.
ga: Uasmhéid na ndiagnóisic a cheadaítear san amharc uirlis Diagnóisic.

source: Context
ga: Comhthéacs

source: Enable tool view
ga: Cumasaigh radharc uirlisí

source: A tool view to display context associated with the current cursor position (LSP hints, diagnostics)
ga: Radharc uirlise chun comhthéacs a bhaineann le suíomh reatha an chúrsóra a thaispeáint (leideanna LSP, diagnóisic)

source: Session
ga: Seisiún

source: Session Management
ga: Bainisteoireacht an tSeisiúin

# The special case of 'Delete unused meta-information after'
source: (never)
ga: (riamh)

# The suffix of 'Delete unused meta-information after'
source: %v day
ga: %v lá

source: When a window is closed the documents opened only in this window are closed as well.
ga: Nuair a dhúntar fuinneog, dúntar na doiciméid nach n-osclaítear ach sa fhuinneog sin freisin.

source: Plugins
ga: Breiseáin

source: Plugin Manager
ga: Bainisteoir Breiseán

source: User Feedback
ga: Aiseolas Úsáideora

source: Bad PATH value
ga: Drochluach PATH

source: The path '%1' doesn't exist
ga: Níl an cosán '%1' ann

source: You have unsaved changes. Do you want to apply the changes or discard them?
ga: Tá athruithe neamhshábháilte agat. Ar mhaith leat na hathruithe a chur i bhfeidhm nó iad a chaitheamh amach?

source: Here you can see all available Kate plugins. Those with a check mark are loaded, and will be loaded again the next time Kate is started.
ga: Anseo is féidir leat na breiseáin Kate uile atá ar fáil a fheiceáil. Tá na breiseáin a bhfuil ticmharc orthu luchtaithe, agus luchtófar arís iad an chéad uair eile a thosófar Kate.

source: Name
ga: Ainm

source: Description
ga: Cur síos

source: <p>The document '%1' has been modified, but not saved.</p><p>Do you want to save your changes or discard them?</p>
ga: <p>Tá an doiciméad '%1' modhnaithe, ach níor sábháladh é.</p><p>Ar mhaith leat do chuid athruithe a shábháil nó iad a chaitheamh amach?</p>

source: Close Document
ga: Dún an Cháipéis

source: Save As
ga: Sábháil Mar

source: New file opened while trying to close Kate, closing aborted.
ga: Osclaíodh comhad nua agus iarracht á déanamh Kate a dhúnadh, cuireadh deireadh leis an dúnadh.

source: Closing Aborted
ga: Dúnadh Ar Ceal

source: Starting Up
ga: Á Thosú

source: Reopening files from the last session...
ga: Comhaid á n-athoscailt ón seisiún is déanaí...

source: Cannot pin untitled documents.
ga: Ní féidir doiciméid gan teideal a phionáil.

source: Cannot pin non local documents.
ga: Ní féidir doiciméid nach doiciméid áitiúla a phionáil.

source: Rename file
ga: Athainmnigh an comhad

source: New file name
ga: Ainm comhaid nua

source: File "%1" could not be moved to "%2"
ga: Níorbh fhéidir an comhad "%1" a bhogadh go "%2"

source: Do you really want to delete file "%1"?
ga: An bhfuil tú cinnte gur mhaith leat comhad "%1" a scriosadh?

source: Delete file
ga: Scrios comhad

source: File "%1" could not be deleted.
ga: Níorbh fhéidir an comhad "%1" a scriosadh.

source: &Other Application...
ga: Feidhmchlár Eile...

source: Use this command to show or hide the view's statusbar
ga: Úsáid an t-ordú seo chun barra stádais an amhairc a thaispeáint nó a chur i bhfolach

source: Show &Tabs
ga: Taispeáin &Cluaisíní

source: Use this command to show or hide the tabs for the views
ga: Úsáid an t-ordú seo chun na cluaisíní do na radhairc a thaispeáint nó a cheilt

source: Sho&w Path in Titlebar
ga: Taispeáin an Cosán sa Bharra Teidil

source: Show the complete document path in the window caption
ga: Taispeáin conair iomlán na cáipéise i bhfotheideal na fuinneoige

source: Show Navigation Bar
ga: Taispeáin Barra Nascleanúna

source: &Window Color Scheme
ga: &Scéim Dathanna Fuinneoige

source: &Previous Tab
ga: &Cluaisín Roimhe Seo

source: Focus the previous tab.
ga: Dírigh ar an táb roimhe seo.

source: &Next Tab
ga: &An Chéad Chluaisín Eile

source: Focus the next tab.
ga: Dírigh ar an chéad chluaisín eile.

# @action Shortcut entry
source: Switch to Tab %1
ga: Athraigh go Tab %1

source: &Quick Open
ga: Oscail go &Tapa

source: Open a form to quick open documents.
ga: Oscail foirm chun doiciméid a oscailt go tapa.

source: Output
ga: Aschur

source: Create a new document
ga: Cruthaigh cáipéis nua

source: Open an existing document for editing
ga: Oscail cáipéis atá ann cheana agus cuir í in eagar

source: This lists files which you have opened recently, and allows you to easily open them again.
ga: Taispeánann sé seo na comhaid a d'oscail tú le déanaí, agus ceadaíonn duit iad a oscailt arís gan stró.

source: Sa&ve All
ga: Sá&bháil Gach Rud

source: Save all open, modified documents to disk.
ga: Sábháil gach cáipéis atá oscailte agus athraithe ar an diosca.

source: Reload A&ll
ga: Athlódáil Gach Rud

source: Reload all open documents.
ga: Athluchtaigh gach cáipéis oscailte.

source: Copies the file path of the current file to clipboard.
ga: Cóipeálann sé cosán comhaid an chomhaid reatha chuig an ghearrthaisce.

source: Copy Filename
ga: Cóipeáil Ainm Comhaid

source: &Open Containing Folder
ga: &Oscail an Fillteán ina bhfuil

# @action:inmenu
source: Rename...
ga: Athainmnigh...

source: Renames the file belonging to the current document.
ga: Athainmníonn sé an comhad a bhaineann leis an doiciméad reatha.

# @action:inmenu
source: Delete
ga: Scrios

source: Deletes the file belonging to the current document.
ga: Scriosann sé an comhad a bhaineann leis an doiciméad reatha.

source: Properties
ga: Airíonna

source: Compare
ga: Déan comparáid

source: Use the Tabbar context menu to compare two documents
ga: Úsáid roghchlár comhthéacs an Tabbar chun dhá dhoiciméad a chur i gcomparáid

source: Shows a hint how to compare documents.
ga: Taispeánann sé leid maidir le conas doiciméid a chur i gcomparáid.

source: Close Orp&haned
ga: Dún Orp&handed

source: Close all documents in the file list that could not be reopened, because they are not accessible anymore.
ga: Dún na doiciméid uile sa liosta comhad nárbh fhéidir a athoscailt, mar nach bhfuil rochtain orthu a thuilleadh.

source: Close the current document.
ga: Dún an cháipéis reatha.

source: Close O&ther
ga: Dún &Eile

source: Close other open documents.
ga: Dún gach cáipéis eile atá oscailte.

source: Clos&e All
ga: Dún Uil&e

source: Close all open documents.
ga: Dún gach cáipéis oscailte.

source: &Reopen Latest Closed Document(s)
ga: &Athoscail an/na Doiciméad/na Doiciméid Dúnta is Déanaí
