Repository: KDE/kate
Catalog: po/*/kate.po
Languages: ga

source: Reopen the document or documents that were most recently closed
ga: Athoscail an doiciméad nó na doiciméid a dúnadh le déanaí

source: Close &Window
ga: Dún &Fuinneog

source: Close this window
ga: Dún an fhuinneog seo

source: Quit the application
ga: Scoir an feidhmchlár

source: New &Window
ga: &Fuinneog Nua

source: Create a new window.
ga: Cruthaigh fuinneog nua.

source: Open W&ith
ga: &Oscail le

source: Open the current document using another application registered for its file type, or an application of your choice.
ga: Oscail an doiciméad reatha ag baint úsáide as feidhmchlár eile atá cláraithe dá chineál comhaid, nó feidhmchlár de do rogha féin.

source: Configure the application's keyboard shortcut assignments.
ga: Cumraigh aicearraí an fheidhmchláir.

source: Configure which items should appear in the toolbar(s).
ga: Cumraigh na míreanna a thaispeánfar sa bharra/sna barraí uirlisí.

source: Configure various aspects of this application and the editing component.
ga: Cumraigh gnéithe éagsúla den fheidhmchlár seo agus den chomhpháirt eagarthóireachta.

source: &Plugins Handbook
ga: &Lámhleabhar na mBreiseán

source: This shows help files for various available plugins.
ga: Taispeánann sé seo comhaid chabhrach do bhreiseáin éagsúla atá ar fáil.

source: Sess&ions
ga: Se&isiúin

# Menu entry Session->New Session
source: &New Session
ga: Seisiún &Nua

source: &Recent Sessions
ga: &Seisiúin Le Déanaí

source: &All Sessions
ga: &Gach Seisiún

source: &Manage Sessions...
ga: &Bainistigh Seisiúin...

source: &Save Session
ga: &Sábháil an Seisiún

source: Save Session &As...
ga: Sábháil an Seisiún M&ar...

source: Pin/Unpin Active Document
ga: Priontáil/Díphionáil Doiciméad Gníomhach

source: Open Next Pinned Document
ga: Oscail an Chéad Doiciméad Prionáilte Eile

source: Go to Previous Location
ga: Téigh go dtí an Suíomh Roimhe Seo

source: Go to Next Location
ga: Téigh go dtí an chéad suíomh eile

source: Show File Git History
ga: Taispeáin Stair Git an Chomhaid

source: &Windows
ga: &Fuinneoga

source: This will close all open documents. Are you sure you want to continue?
ga: Dúnfaidh sé seo gach doiciméad oscailte. An bhfuil tú cinnte gur mian leat leanúint ar aghaidh?

source: Close all documents?
ga: Gach doiciméad a dhúnadh?

source: Close All
ga: Dún Gach Rud

source: This will close all open documents beside the current one. Are you sure you want to continue?
ga: Dúnfaidh sé seo gach doiciméad oscailte seachas an ceann reatha. An bhfuil tú cinnte gur mian leat leanúint ar aghaidh?

source: Close all documents beside current one?
ga: Gach doiciméad seachas an ceann reatha a dhúnadh?

source: Close Others
ga: Dún Eile

source: This will hide the menu bar completely. You can show it again by typing %1.
ga: Cuirfidh sé seo an barra roghchláir i bhfolach go hiomlán. Is féidir leat é a thaispeáint arís trí %1 a chlóscríobh.

source: Hide menu bar
ga: Folaigh an barra roghchláir

source: You dropped the directory %1 into Kate. Do you want to open all files contained in it?
ga: Chuir tú an eolaire %1 i Kate. Ar mhaith leat na comhaid go léir atá ann a oscailt?

# @title:window
source: Open Files Recursively
ga: Oscail Comhaid go hAthchúrsach

# @action:button
source: Open All Files
ga: Oscail Gach Comhad

source: [read only]
ga: [léamh amháin]

source: Toolview Manager
ga: Bainisteoir Amharc Uirlisí

source: Sidebar Buttons
ga: Cnaipí Barra Taoibh

source: Focus Toolview
ga: Radharc Uirlisí Fócas

source: Tool &Views
ga: &Amhairc Uirlisí

source: Show Side&bars
ga: Taispeáin &Barraí Taoibh

source: Hide All Tool Views
ga: Folaigh Gach Radharc Uirlis

source: Show %1
ga: Taispeáin %1

source: Show %1 Button
ga: Taispeáin Cnaipe %1

source: Focus %1
ga: Fócas %1

source: Configure...
ga: Cumraigh...

source: Hide Button
ga: Folaigh an Cnaipe

source: Move To
ga: Bog Go

source: Own Section
ga: Roinn Féin

source: One Down
ga: Ceann Síos

source: One Right
ga: Aon Cheart

source: One Up
ga: Ceann Suas

source: One Left
ga: Ceann amháin ar chlé

source: Left Sidebar
ga: Barra Taoibh Ar Chlé

source: Right Sidebar
ga: Barra Taoibh Ar Dheis

source: Top Sidebar
ga: Barra Taobh

source: Bottom Sidebar
ga: Barra Taobh Bun

source: <qt>You are about to hide the sidebars. With hidden sidebars it is not possible to directly access the tool views with the mouse anymore, so if you need to access the sidebars again invoke <b>View &gt; Tool Views &gt; Show Sidebars</b> in the menu. It is still possible to show/hide the tool views with the assigned shortcuts.</qt>
ga: <qt>Tá tú ar tí na barraí taoibh a cheilt. Le barraí taoibh i bhfolach ní féidir rochtain dhíreach a fháil ar na radhairc uirlisí leis an luch a thuilleadh, mar sin má theastaíonn uait rochtain a fháil ar na barraí taoibh arís glaoigh ar <b>Amharc &gt; Radhairc Uirlisí &gt; Taispeáin Barraí Taoibh</b> sa roghchlár. Is féidir fós na radhairc uirlisí a thaispeáint/a cheilt leis na haicearraí sannta.</qt>

source: Documents Modified on Disk
ga: Cáipéisí Athraithe ar an Diosca

source: <qt>The documents listed below have changed on disk.<p>Select one or more at once, and press an action button until the list is empty.</p></qt>
ga: <qt>Tá na doiciméid atá liostaithe thíos athraithe ar an diosca.<p>Roghnaigh ceann amháin nó níos mó ag an am céanna, agus brúigh cnaipe gníomhaíochta go dtí go mbeidh an liosta folamh.</p></qt>

source: Filename
ga: Ainm comhaid

source: Status on Disk
ga: Stádas ar an Diosca

source: Modified
ga: Athraithe

source: Created
ga: Cruthaithe

source: Deleted
ga: Scriosta

source: &View Difference
ga: A&mharc ar Dhifríochtaí

source: Calculates the difference between the editor contents and the disk file for the selected document.
ga: Ríomhann sé an difríocht idir ábhar an eagarthóra agus an comhad diosca don doiciméad roghnaithe.

source: &Ignore Changes
ga: Déan neamha&ird d'Athruithe

source: Remove modified flag from selected documents
ga: Bain bratach mhodhnaithe de na doiciméid roghnaithe

source: Overwrite selected documents, discarding disk changes
ga: Scríobh doiciméid roghnaithe thar ceal, ag fáil réidh le hathruithe ar an diosca

source: &Reload
ga: &Athluchtaigh

source: Reload selected documents from disk
ga: Athlódáil na doiciméid roghnaithe ón diosca

source: Could not save the document '%1'
ga: Ní féidir an cháipéis a shábháil: '%1'

source: Please install git to view diffs
ga: Suiteáil git le do thoil chun na difríochtaí a fheiceáil

source: The diff command failed. Please make sure that git is installed and in your PATH.
ga: Theip ar an ordú diff. Déan cinnte go bhfuil git suiteáilte agus i do PATH.

source: Error Creating Diff
ga: Earráid agus Diff á Chruthú

source: [OLD]
ga: [SEAN]

source: [NEW]
ga: [NUA]

source: Search...
ga: Cuardaigh...

source: Copy all text to clipboard
ga: Cóipeáil an téacs go léir chuig an ghearrthaisce

source: Clear all messages
ga: Glan gach teachtaireacht

# @info
source: Error
ga: Earráid

# @info
source: Warning
ga: Rabhadh

source: Info
ga: Eolas

# @info
source: Log
ga: Logáil

source: Save As (%1)
ga: Sábháil Mar (%1)

source: Save Documents
ga: Sábháil Cáipéisí

source: The document "%1" has been modified. Do you want to save your changes or discard them?
ga: Tá an doiciméad "%1" athraithe. Ar mhaith leat do chuid athruithe a shábháil nó iad a chaitheamh amach?

source: <qt>The following documents have been modified. Do you want to save them before closing?</qt>
ga: <qt>Tá na doiciméid seo a leanas modhnaithe. Ar mhaith leat iad a shábháil sula ndúnfar iad?</qt>

source: Documents
ga: Cáipéisí

source: Location
ga: Suíomh

source: Se&lect All
ga: Ro&ghnaigh Gach Rud

source: Data you requested to be saved could not be written. Please choose how you want to proceed.
ga: Níorbh fhéidir na sonraí a d'iarr tú a shábháil a scríobh. Roghnaigh conas is mian leat dul ar aghaidh, le do thoil.

# @menu:action
source: Copy Location
ga: Cóipeáil Suíomh

# @menu:action
source: Copy Filename
ga: Cóipeáil Ainm Comhaid

source: Split Ve&rtical
ga: Roinn go hIngea&rach

source: Split the currently active view vertically into two views.
ga: Roinn an t-amharc reatha go hingearach i dhá amharc.

source: Split &Horizontal
ga: Roinn &go Cothrománach

source: Split the currently active view horizontally into two views.
ga: Roinn an t-amharc reatha go cothrománach i dhá amharc.

source: Move Document to New Vertical Split
ga: Bog Doiciméad go Scoilt Ingearach Nua

source: Split the currently active view vertically into two views and move the currently active document to right view.
ga: Roinn an radharc atá gníomhach faoi láthair go hingearach ina dhá radharc agus bog an doiciméad atá gníomhach faoi láthair go dtí an radharc ar dheis.

source: Move Document to New Horizontal Split
ga: Bog Doiciméad go Scoilt Chothrománach Nua

source: Split the currently active view horizontally into two views and move the currently active document to view below.
ga: Roinn an radharc atá gníomhach faoi láthair go cothrománach ina dhá radharc agus bog an doiciméad atá gníomhach faoi láthair go dtí an radharc thíos.

source: Cl&ose Current View
ga: &Dún an tAmharc Reatha

source: Close the currently active split view
ga: Dún an t-amharc roinnte atá gníomhach faoi láthair

source: Close Inactive Views
ga: Dún Radharcanna Neamhghníomhacha

source: Close every view but the active one
ga: Dún gach radharc ach amháin an ceann gníomhach

source: Hide Inactive Views
ga: Folaigh Radharcanna Neamhghníomhacha

source: Hide every view but the active one
ga: Folaigh gach radharc ach amháin an ceann gníomhach

source: Toggle Orientation
ga: Treoshuíomh a Athrú

source: Toggles the orientation of the current split view
ga: Athraíonn treoshuíomh an radhairc scoilte reatha

source: Next Split View
ga: An Chéad Radharc Scoilte Eile

source: Make the next split view the active one.
ga: Déan an chéad radharc scoilte eile mar an ceann gníomhach.

source: Previous Split View
ga: Radharc Scoilte Roimhe Seo

source: Make the previous split view the active one.
ga: Déan an radharc scoilte roimhe seo mar an ceann gníomhach.

source: Left Split View
ga: Radharc Scoilte Ar Chlé

source: Make the split view intuitively on the left the active one.
ga: Déan an radharc scoilte ar chlé go hintuigthe mar an ceann gníomhach.

source: Right Split View
ga: Radharc Scoilte Ar Dheis

source: Make the split view intuitively on the right the active one.
ga: Déan an radharc scoilte ar dheis go hintuigthe mar an ceann gníomhach.

source: Upward Split View
ga: Radharc Scoilte Suas

source: Make the split view intuitively upward the active one.
ga: Déan an radharc scoilte go hintuigthe suas an ceann gníomhach.

source: Downward Split View
ga: Radharc Scoilte Anuas

source: Make the split view intuitively downward the active one.
ga: Déan an radharc scoilte go hintuigthe síos an ceann gníomhach.

source: Move Splitter Right
ga: Bog an Scoilteoir ar Dheis

source: Move the splitter of the current view to the right
ga: Bog scoilteoir an radhairc reatha ar dheis

source: Move Splitter Left
ga: Bog an Scoilteoir ar Chlé

source: Move the splitter of the current view to the left
ga: Bog scoilteoir an radhairc reatha ar chlé

source: Move Splitter Up
ga: Bog an Scoilteoir Suas

source: Move the splitter of the current view up
ga: Bog scoilteoir an radhairc reatha suas

source: Move Splitter Down
ga: Bog an Scoilteoir Síos

source: Move the splitter of the current view down
ga: Bog scoilteoir an radhairc reatha síos

source: Focus Navigation Bar
ga: Barra Nascleanúna Fócas

source: Focus the navigation bar
ga: Dírigh an barra nascleanúna

source: Welcome Page
ga: Leathanach Fáilte

source: Show the welcome page
ga: Taispeáin an leathanach fáilte

source: Toggle Scroll Synchronization
ga: Sioncrónú Scrollaigh a Athrú

source: Toggle scroll synchronization for the current view
ga: Scoránaigh sioncrónú scrolla don radharc reatha

source: Detach Active Document
ga: Dícheangail Doiciméad Gníomhach

source: Opens the active document in a new window and closes it in the current window
ga: Osclaíonn sé an doiciméad gníomhach i bhfuinneog nua agus dúnann sé é sa fhuinneog reatha

source: <p>You are attempting to open one or more large files:</p><ul>%1</ul><p>Do you want to proceed?</p><p><strong>Beware that kate may stop responding for some time when opening large files.</strong></p>
ga: <p>Tá tú ag iarraidh comhad mór amháin nó níos mó a oscailt:</p><ul>%1</ul><p>Ar mhaith leat dul ar aghaidh?</p><p><strong>Tabhair faoi deara go bhféadfadh Kate stopadh ag freagairt ar feadh tamaill agus comhaid mhóra á n-oscailt.</strong></p>

source: Opening Large File
ga: Ag Oscailt Comhaid Mhóir

source: %1 cannot open folders
ga: Ní féidir le %1 fillteáin a oscailt

source: The plugin required to open folders was not found
ga: Níor aimsíodh an breiseán a bhí riachtanach chun fillteáin a oscailt

source: In order to open folders, the <b>%1</b> plugin must be enabled. Enable it?
ga: Chun fillteáin a oscailt, ní mór an breiseán <b>%1</b> a bheith cumasaithe. Ar mhaith leat é a chumasú?

# @title:window
source: Open Folder
ga: Oscail Fillteán

# @action:button
source: Enable
ga: Cumasaigh

source: Failed to enable <b>%1</b> plugin
ga: Theip ar an mbreiseán <b>%1</b> a chumasú

source: The file '%1' does not exist
ga: Níl an comhad '%1' ann

source: Synchronize Scrolling
ga: Sioncrónaigh Scrolláil

source: Synchronize scrolling of this split-view with other synchronized split-views
ga: Sioncrónaigh scrollú an radhairc scoilte seo le radhairc scoilte sioncrónaithe eile

source: Click here to switch to the Quick Open view.
ga: Cliceáil anseo chun aistriú go dtí an radharc Oscailte Tapa.

source: Control view space splitting
ga: Rialú spáis radhairc scoilteadh

source: Currently, there is one more document open. To see all open documents, switch to the Quick Open view by clicking here.
ga: Tá doiciméad amháin eile oscailte faoi láthair. Chun na doiciméid oscailte go léir a fheiceáil, aistrigh go dtí an radharc Oscailte Tapa trí chliceáil anseo.

source: &Close Tab
ga: &Dún an Cluaisín

source: Close &Other Tabs
ga: Dún &Cluaisíní Eile

source: Close All &Tabs
ga: Dún Gach Cluaisín

source: D&etach Document
ga: Doiciméad a Dhícheangal

source: Opens the document in a new window and closes it in the current window
ga: Osclaíonn sé an doiciméad i bhfuinneog nua agus dúnann sé é sa fhuinneog reatha

source: Compare with Active Document
ga: Déan comparáid le Doiciméad Gníomhach

source: Compare with Active Document Using
ga: Déan comparáid le Doiciméad Gníomhach ag Úsáid

source: Unpin Document
ga: Díphionáil an Doiciméid

source: Pin Document
ga: Doiciméad bioráin

source: Can not open %1
ga: Ní féidir %1 a oscailt

source: No toolview found for name: '%1'. Is the plugin for it disabled or the name is misspelled?
ga: Níor aimsíodh aon radharc uirlisí don ainm: '%1'. An bhfuil an breiseán dó díchumasaithe nó an bhfuil an t-ainm mílitrithe?

source: Script error. Expected a toolview name. Available: %1
ga: Earráid scripte. Bhíothas ag súil le hainm radhairc uirlisí. Ar fáil: %1

source: Scripting
ga: Scriptiú

source: 'showtoolview $toolview_name'. Show a toolview panel. Available panels: %1
ga: 'showtoolview $toolview_name'. Taispeáin painéal radhairc uirlisí. Painéil atá ar fáil: %1

source: 'showtoolview $toolview_name'. Hide a toolview panel. Available panels: %1
ga: 'showtoolview $toolview_name'. Folaigh painéal radhairc uirlisí. Painéil atá ar fáil: %1

# The text is shown as a placeholder in an input line edit, keep it short
source: Search files in all projects (right click to configure)
ga: Cuardaigh comhaid i ngach tionscadal (cliceáil ar dheis chun cumrú)

# The text is shown as a placeholder in an input line edit, keep it short
source: Search files in current project (right click to configure)
ga: Cuardaigh comhaid sa tionscadal reatha (cliceáil ar dheis chun cumrú)

source: All Projects
ga: Gach Tionscadal

source: Current Project
ga: Tionscadal Reatha

source: Fuzzy Filtering
ga: Scagadh Doiléir

source: Wildcard Filtering
ga: Scagadh Fiáin

source: Project: %1
ga: Tionscadal: %1

source: Manage Sessions
ga: Bainistigh Seisiúin

source: Session Chooser
ga: Roghnóir Seisiúin

source: Restore
ga: Athchóirigh

source: Session will be deleted on dialog close
ga: Scriosfar an seisiún nuair a dhúnfar an dialóg

source: Filter Sessions
ga: Scag Seisiúin

source: Session Name
ga: Ainm an tSeisiúin

source: Files
ga: Comhaid

source: Last opened
ga: Osclaíodh go deireanach

source: &Open
ga: &Oscail

source: New Session
ga: Seisiún Nua

source: Open as Template
ga: Oscail mar Theimpléad

source: Don't ask again
ga: Ná fiafraigh arís

source: Duplicate...
ga: Dúblach...

source: &Rename...
ga: &Athainmnigh...

source: Delete
ga: Scrios

source: Close
ga: Dún

source: Session '%1' is already opened in another Kate instance. Switch to that or reopen in this instance?
ga: Tá seisiún '%1' oscailte cheana féin in áit eile de chuid Kate. Athraigh go dtí sin nó athoscail sa áit seo?

# @action:button
source: Switch to Instance
ga: Athraigh go dtí an Chás

# @action:button
source: Reopen
ga: Athoscail

source: The session could not be renamed to "%1". Failed to write to "%2"
ga: Níorbh fhéidir an seisiún a athainmniú go "%1". Theip ar scríobh chuig "%2".

source: Session Renaming
ga: Athainmniú Seisiúin

source: Session name:
ga: Ainm an tseisiúin:

source: There is already an existing session with your chosen name: %1 Please choose a different one.
ga: Tá seisiún ann cheana féin leis an ainm a roghnaigh tú: %1 Roghnaigh ceann eile le do thoil.

source: To save a session, you must specify a name.
ga: Chun seisiún a shábháil, caithfidh tú ainm a shonrú.

source: Specify a name for this session
ga: Sonraigh ainm don seisiún seo

source: Specify a new name for session: %1
ga: Sonraigh ainm nua don seisiún: %1

source: Application Startup Behavior
ga: Iompar Tosaithe Feidhmchláir

source: &Start new session
ga: To&saigh seisiún nua

source: &Load last used session
ga: &Lódáil an seisiún deireanach a úsáideadh

source: &Manually choose a session
ga: Roghnaigh seisiún de lái&mh

source: Application Startup/Shutdown Behavior
ga: Iompar Tosaithe/Múchta Feidhmchláir

source: Automatically save and restore:
ga: Sábháil agus athchóirigh go huathoibríoch:

source: Newly-created unsaved files
ga: Comhaid neamhshábháilte nua-chruthaithe

source: Files with unsaved changes
ga: Comhaid le hathruithe neamhshábháilte

source: If disabled, an untitled document will be shown for new windows.
ga: Mura bhfuil sé seo in úsáid, taispeánfar doiciméad gan teideal le haghaidh fuinneoga nua.

source: Show welcome view for new windows
ga: Taispeáin radharc fáilte do fhuinneoga nua

source: If enabled, the application will shutdown when the last file being edited is closed, otherwise a blank page will open so that you can start a new file.
ga: Má tá sé cumasaithe, múchfaidh an feidhmchlár nuair a dhúnfar an comhad deireanach atá á chur in eagar, nó osclófar leathanach bán ionas gur féidir leat comhad nua a thosú.

source: Close the application entirely when the last file is closed
ga: Dún an feidhmchlár go hiomlán nuair a bhíonn an comhad deireanach dúnta

source: Close documents with the window they belong to
ga: Dún na doiciméid leis an bhfuinneog lena mbaineann siad

source: Session Elements
ga: Eilimintí Seisiúin

source: The session contains the list of open documents, recently opened files list, bookmarks, cursor position etc. When the session is loaded all elements are restored.
ga: Tá liosta na ndoiciméad oscailte, liosta na gcomhad a osclaíodh le déanaí, leabharmharcanna, suíomh an chúrsóra srl. sa seisiún. Nuair a luchtófar an seisiún, athchóirítear na heilimintí go léir.

source: Maximum number of entries in recent file list:
ga: Uasmhéid na n-iontrálacha sa liosta comhad le déanaí:

source: Check this if you want all your views and frames restored each time you open the application.
ga: Seiceáil seo más mian leat do radhairc agus frámaí go léir a athbhunú gach uair a osclaíonn tú an feidhmchlár.

source: Include &window configuration
ga: Cuir cumraíocht &fhuinneoige san áireamh

source: Check this if you want document configuration like for example bookmarks to be saved past editor sessions. The configuration will be restored if the document has not changed when reopened.
ga: Seiceáil seo más mian leat cumraíocht doiciméad, mar shampla leabharmharcanna, a shábháil i ndiaidh seisiúin an eagarthóra. Athchóireofar an chumraíocht mura n-athraítear an doiciméad nuair a athosclaítear é.

source: Keep &meta-information past sessions
ga: Coinnigh &meitea-fhaisnéis seisiúin roimhe seo

source: Delete unused meta-information after:
ga: Scrios meitea-fhaisnéis neamhúsáidte i ndiaidh:

source: Welcome to %1
ga: Fáilte go %1

source: Recent Documents and Projects
ga: Doiciméid agus Tionscadail Le Déanaí

source: Recent Documents
ga: Doiciméid Le Déanaí

source: No recent documents or projects
ga: Gan aon doiciméid ná tionscadail le déanaí

source: No recent documents
ga: Gan aon doiciméid le déanaí

source: No saved sessions
ga: Gan aon seisiúin shábháilte

source: Open Selected Files...
ga: Oscail Comhaid Roghnaithe...

source: Copy &Location
ga: Cóipeáil &Suíomh

source: &Remove
ga: &Bain

source: Welcome
ga: Fáilte

source: New File
ga: Comhad Nua

source: Open Folder...
ga: Oscail Fillteán...

source: Recent Files
ga: Comhaid Le Déanaí

source: Open File...
ga: Oscail Comhad...

source: Clear Recent Files
ga: Glan Comhaid Le Déanaí

source: Help
ga: Cabhair

source: Visit homepage
ga: Tabhair cuairt ar an leathanach baile

source: Get involved
ga: Bí páirteach

source: Read handbook
ga: Léigh an lámhleabhar

source: Saved Sessions
ga: Seisiúin Shábháilte

source: Manage Sessions...
ga: Bainistigh Seisiúin...

source: Show welcome page for new window
ga: Taispeáin leathanach fáilte don fhuinneog nua
