Repository: KDE/kate
Catalog: po/*/lspclient.po
Languages: gl

source: Filter…
gl: Filtrar…

source: LSP Client
gl: Cliente de LSP

source: No JSON data to validate.
gl: Non hai datos JSON para validar.

source: JSON data is valid.
gl: Os datos JSON son válidos.

source: JSON data is invalid: no JSON object
gl: Os datos JSON non son válidos: non hai un obxecto JSON.

source: JSON data is invalid: %1
gl: Os datos JSON non son válidos: %1

source: Delete selected entries
gl: Eliminar as entradas escollidas

source: Delete all entries
gl: Eliminar todas as entradas

source: LSP server start requested
gl: Solicitouse iniciar o servidor de LSP

source: Do you want the LSP server to be started?<br><br>The full command line is:<br><br><b>%1</b><br><br>The choice can be altered via the config page of the plugin.
gl: Quere iniciar o servidor de LSP?<br><br>A liña de ordes completa é:<br><br><b>%1</b><br><br>A escolla pode alterarse desde a páxina de configuración do complemento.

source: User permanently blocked start of: '%1'. Use the config page of the plugin to undo this block.
gl: A persoa usuaria bloqueou permanentemente o inicio de: «%1». Use a páxina de configuración do complemento para desfacer o bloqueo.

source: Go to Definition
gl: Ir á definición

source: Go to Declaration
gl: Ir á declaración

source: Go to Type Definition
gl: Ir á definición do tipo

source: Find References
gl: Atopar referencias

source: Find Implementations
gl: Atopar as implementacións

source: Highlight
gl: Realzar

source: Symbol Info
gl: Información do símbolo

source: Search and Go to Symbol
gl: Buscar e ir ao símbolo

source: Format
gl: Formatar

source: Rename
gl: Renomear

source: Expand Selection
gl: Expandir a selección

source: Shrink Selection
gl: Reducir a selección

source: Switch Source Header
gl: Alternar a cabeceira e a fonte

source: Expand Macro
gl: Expandilo a macro

source: Code Action
gl: Acción de código

source: Show lsp completions
gl: Amosar as completacións de LSP

source: Show selected completion documentation
gl: Amosar a documentación do completado seleccionado

source: Enable signature help with auto completion
gl: Activar a axuda da sinatura con completación automática

source: Include declaration in references
gl: Incluír a declaración nas referencias

source: Add parentheses upon function completion
gl: Engadir parénteses ao completar unha función.

source: Show hover information
gl: Amosar información ao cubrir

source: Format on typing
gl: Formatar ao escribir.

source: Incremental document synchronization
gl: Sincronización incremental dos documentos

source: Highlight goto location
gl: Realzar a localización dos «goto».

source: Show Inlay Hints
gl: Amosar consellos incrustados

source: Show Diagnostics Notifications
gl: Amosar notificacións do diagnóstico

source: Show Messages
gl: Amosar as mensaxes

source: Server Memory Usage
gl: Uso de memoria do servidor

source: Close All Dynamic Reference Tabs
gl: Pechar todas as lapelas de referencia dinámica

source: Restart LSP Server
gl: Reiniciar o servidor de LSP

source: Restart All LSP Servers
gl: Reiniciar todos os servidores de LSP

source: Go To
gl: Ir a

source: More options
gl: Máis opcións

source: Expand All
gl: Expandilo todo

source: Collapse All
gl: Pregalo todo

source: RangeHighLight
gl: Realce de intervalo

source: Line: %1:
gl: Liña: %1:

source: No results
gl: Non hai resultados

# @title:tab
source: Definition: %1
gl: Definición: %1

# @title:tab
source: Declaration: %1
gl: Declaración: %1

# @title:tab
source: Type Definition: %1
gl: Definición do tipo: %1

# @title:tab
source: References: %1
gl: Referencias: %1

# @title:tab
source: Implementation: %1
gl: Implementación: %1

# @title:tab
source: Highlight: %1
gl: Realzar: %1

source: No Actions
gl: Non hai accións

source: Loading...
gl: Cargando…

source: No edits
gl: Non hai edicións

# @title:window
source: Rename
gl: Renomear

# @label:textbox
source: New name (caution: not all references may be replaced)
gl: Novo nome (ollo: poden non substituírse todas as referencias)

source: Not enough results
gl: Non hai resultados dabondo.

source: Corresponding Header/Source not found
gl: Non se atopou a cabeceira ou fonte correspondente.

# @info
source: LSP Server
gl: Servidor de LSP

# @info
source: LSP Client
gl: Cliente de LSP

source: Question from LSP server
gl: Pregunta do servidor de LSP

source: Restarting
gl: Reiniciando

source: NOT Restarting
gl: NON reiniciando

source: Server terminated unexpectedly ... %1 [%2] [homepage: %3]
gl: O servidor terminou inesperadamente… %1 [%2] [páxina principal: %3]

source: Failed to find server binary: %1
gl: Non foi posíbel atopar o binario do servidor: %1

source: Please check your PATH for the binary
gl: Revise o seu PATH en busca do binario.

source: See also %1 for installation or details
gl: Consulte tamén %1 sobre a instalación ou máis información.

source: Failed to start server: %1
gl: Non foi posíbel iniciar o servidor: %1

source: Started server %2: %1
gl: Iniciouse o servidor %2: %1

source: Failed to parse server configuration '%1': no JSON object
gl: Non foi posíbel analizar a configuración de servidor «%1»: non é un obxecto JSON.

source: Failed to parse server configuration '%1': %2
gl: Non se puido analizar a configuración de servidor «%1»: %2

source: Failed to read server configuration: %1
gl: Non foi posíbel ler a configuración do servidor: %1

source: Symbol Outline
gl: Esquema dos símbolos

source: Tree Mode
gl: Modo de árbore

source: Automatically Expand Tree
gl: Expandir a árbore automaticamente

source: Sort Alphabetically
gl: Ordenar alfabeticamente

source: Show Details
gl: Amosar os detalles

source: Symbols
gl: Símbolos

source: LSP server does not support symbol outline.
gl: O servidor de LSP non permite un esquema de símbolos.

source: No LSP server for this document.
gl: Non hai un servidor de LSP para este documento.

source: Client Settings
gl: Configuración do cliente

source: Format on save
gl: Formatar ao gardar.

source: Enable semantic highlighting
gl: Activar o realce semántico.

source: Enable inlay hints
gl: Activar os consellos incrustados.

source: Completions:
gl: Completacións:

source: Show completions
gl: Amosar as completacións.

source: Show inline docs for selected completion
gl: Amosar documentación in situ da completación seleccionada.

source: Show function signature when typing a function call
gl: Amosar a sinatura da función ao escribir a chamada dunha función.

source: Add imports automatically if needed upon completion
gl: Engadir automaticamente as importación que se necesiten ao completar.

source: Navigation:
gl: Navegación:

source: Count declarations when searching for references to a symbol
gl: Contar as declaracións ao buscar referencias a un símbolo.

source: Show information about currently hovered symbol
gl: Amosar información sobre o símbolo que se estea a cubrir.

source: Highlight target line when hopping to it
gl: Realzar a liña de destino ao saltar a ela.

source: Server:
gl: Servidor:

source: Show program diagnostics
gl: Amosar o diagnóstico do programa.

source: Show notifications from the LSP server
gl: Amosar as notificacións do servidor de LSP.

source: Incrementally synchronize documents with the LSP server
gl: Sincronizar incrementalmente os documentos co servidor de LSP.

source: Document outline:
gl: Esquema do documento:

source: Sort symbols alphabetically
gl: Ordenar os símbolos alfabeticamente.

source: Display additional details for symbols
gl: Amosar detalles adicionais dos símbolos.

source: Present symbols in a hierarchy instead of a flat list
gl: Presentar os símbolos nunha xerarquía en vez de como unha lista plana.

source: Automatically expand tree
gl: Expandir a árbore automaticamente.

source: Allowed && Blocked Servers
gl: Servidores permitidos e bloqueados

source: User Server Settings
gl: Configuración do servidor da persoa usuaria

source: Settings File:
gl: Ficheiro de configuración:

source: Default Server Settings
gl: Configuración predeterminada do servidor

source: &LSP Client
gl: Cliente de &LSP

source: More Options
gl: Máis opcións
